/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align> {
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]

pub const USB_REQ_CDC_SEND_ENCAPSULATED_COMMAND: u32 = 0;
pub const USB_REQ_CDC_GET_ENCAPSULATED_RESPONSE: u32 = 1;
pub const USB_REQ_CDC_SET_COMM_FEATURE: u32 = 2;
pub const USB_REQ_CDC_GET_COMM_FEATURE: u32 = 3;
pub const USB_REQ_CDC_CLEAR_COMM_FEATURE: u32 = 4;
pub const USB_REQ_CDC_SET_AUX_LINE_STATE: u32 = 16;
pub const USB_REQ_CDC_SET_HOOK_STATE: u32 = 17;
pub const USB_REQ_CDC_PULSE_SETUP: u32 = 18;
pub const USB_REQ_CDC_SEND_PULSE: u32 = 19;
pub const USB_REQ_CDC_SET_PULSE_TIME: u32 = 20;
pub const USB_REQ_CDC_RING_AUX_JACK: u32 = 21;
pub const USB_REQ_CDC_SET_LINE_CODING: u32 = 32;
pub const USB_REQ_CDC_GET_LINE_CODING: u32 = 33;
pub const USB_REQ_CDC_SET_CONTROL_LINE_STATE: u32 = 34;
pub const USB_REQ_CDC_SEND_BREAK: u32 = 35;
pub const USB_REQ_CDC_SET_RINGER_PARMS: u32 = 48;
pub const USB_REQ_CDC_GET_RINGER_PARMS: u32 = 49;
pub const USB_REQ_CDC_SET_OPERATION_PARMS: u32 = 50;
pub const USB_REQ_CDC_GET_OPERATION_PARMS: u32 = 51;
pub const USB_REQ_CDC_SET_LINE_PARMS: u32 = 52;
pub const USB_REQ_CDC_GET_LINE_PARMS: u32 = 53;
pub const USB_REQ_CDC_DIAL_DIGITS: u32 = 54;
pub const USB_REQ_CDC_SET_UNIT_PARAMETER: u32 = 55;
pub const USB_REQ_CDC_GET_UNIT_PARAMETER: u32 = 56;
pub const USB_REQ_CDC_CLEAR_UNIT_PARAMETER: u32 = 57;
pub const USB_REQ_CDC_GET_PROFILE: u32 = 58;
pub const USB_REQ_CDC_SET_ETHERNET_MULTICAST_FILTERS: u32 = 64;
pub const USB_REQ_CDC_SET_ETHERNET_POWER_MANAGEMENT_PATTERNFILTER: u32 = 65;
pub const USB_REQ_CDC_GET_ETHERNET_POWER_MANAGEMENT_PATTERNFILTER: u32 = 66;
pub const USB_REQ_CDC_SET_ETHERNET_PACKET_FILTER: u32 = 67;
pub const USB_REQ_CDC_GET_ETHERNET_STATISTIC: u32 = 68;
pub const USB_REQ_CDC_SET_ATM_DATA_FORMAT: u32 = 80;
pub const USB_REQ_CDC_GET_ATM_DEVICE_STATISTICS: u32 = 81;
pub const USB_REQ_CDC_SET_ATM_DEFAULT_VC: u32 = 82;
pub const USB_REQ_CDC_GET_ATM_VC_STATISTICS: u32 = 83;
pub const USB_REQ_CDC_NOTIFY_RING_DETECT: u32 = 9;
pub const USB_REQ_CDC_NOTIFY_SERIAL_STATE: u32 = 32;
pub const USB_REQ_CDC_NOTIFY_CALL_STATE_CHANGE: u32 = 40;
pub const USB_REQ_CDC_NOTIFY_LINE_STATE_CHANGE: u32 = 41;
pub const USB_CDC_HDR_DESC_LEN: u32 = 5;
pub const USB_CDC_CALL_MGMT_DESC_LEN: u32 = 5;
pub const USB_CDC_ACM_DESC_LEN: u32 = 4;
pub const USB_CDC_UNION_DESC_LEN: u32 = 5;
pub const CDC_CALL_MGMT_SUPPORTED: u32 = 1;
pub const CDC_CALL_MGMT_OVER_DCI: u32 = 2;
pub const CDC_ACM_SUPPORT_FEATURE_REQUESTS: u32 = 1;
pub const CDC_ACM_SUPPORT_LINE_REQUESTS: u32 = 2;
pub const CDC_ACM_SUPPORT_SENDBREAK_REQUESTS: u32 = 4;
pub const CDC_ACM_SUPPORT_NOTIFY_REQUESTS: u32 = 8;
pub const CDC_CTRL_SIGNAL_ACTIVATE_CARRIER: u32 = 2;
pub const CDC_CTRL_SIGNAL_DTE_PRESENT: u32 = 1;
pub type size_t = cty::c_uint;
pub type wchar_t = cty::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: cty::c_longlong,
    pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        16usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        8usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __int8_t = cty::c_schar;
pub type __uint8_t = cty::c_uchar;
pub type __int16_t = cty::c_short;
pub type __uint16_t = cty::c_ushort;
pub type __int32_t = cty::c_int;
pub type __uint32_t = cty::c_uint;
pub type __int64_t = cty::c_longlong;
pub type __uint64_t = cty::c_ulonglong;
pub type __int_least8_t = cty::c_schar;
pub type __uint_least8_t = cty::c_uchar;
pub type __int_least16_t = cty::c_short;
pub type __uint_least16_t = cty::c_ushort;
pub type __int_least32_t = cty::c_int;
pub type __uint_least32_t = cty::c_uint;
pub type __int_least64_t = cty::c_longlong;
pub type __uint_least64_t = cty::c_ulonglong;
pub type __intmax_t = cty::c_longlong;
pub type __uintmax_t = cty::c_ulonglong;
pub type __intptr_t = cty::c_int;
pub type __uintptr_t = cty::c_uint;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = cty::c_schar;
pub type uint_fast8_t = cty::c_uchar;
pub type int_fast16_t = cty::c_short;
pub type uint_fast16_t = cty::c_ushort;
pub type int_fast32_t = cty::c_int;
pub type uint_fast32_t = cty::c_uint;
pub type int_fast64_t = cty::c_longlong;
pub type uint_fast64_t = cty::c_ulonglong;
pub type RoReg = u32;
pub type RoReg16 = u16;
pub type RoReg8 = u8;
pub type WoReg = u32;
pub type WoReg16 = u16;
pub type WoReg8 = u8;
pub type RwReg = u32;
pub type RwReg16 = u16;
pub type RwReg8 = u8;
#[doc = "<  2 Non Maskable Interrupt"]
pub const IRQn_NonMaskableInt_IRQn: IRQn = -14;
#[doc = "<  3 Hard Fault Interrupt"]
pub const IRQn_HardFault_IRQn: IRQn = -13;
#[doc = "< 11 SV Call Interrupt"]
pub const IRQn_SVCall_IRQn: IRQn = -5;
#[doc = "< 14 Pend SV Interrupt"]
pub const IRQn_PendSV_IRQn: IRQn = -2;
#[doc = "< 15 System Tick Interrupt"]
pub const IRQn_SysTick_IRQn: IRQn = -1;
#[doc = "<  0 SAMD21E18A Power Manager (PM)"]
pub const IRQn_PM_IRQn: IRQn = 0;
#[doc = "<  1 SAMD21E18A System Control (SYSCTRL)"]
pub const IRQn_SYSCTRL_IRQn: IRQn = 1;
#[doc = "<  2 SAMD21E18A Watchdog Timer (WDT)"]
pub const IRQn_WDT_IRQn: IRQn = 2;
#[doc = "<  3 SAMD21E18A Real-Time Counter (RTC)"]
pub const IRQn_RTC_IRQn: IRQn = 3;
#[doc = "<  4 SAMD21E18A External Interrupt Controller (EIC)"]
pub const IRQn_EIC_IRQn: IRQn = 4;
#[doc = "<  5 SAMD21E18A Non-Volatile Memory Controller (NVMCTRL)"]
pub const IRQn_NVMCTRL_IRQn: IRQn = 5;
#[doc = "<  6 SAMD21E18A Direct Memory Access Controller (DMAC)"]
pub const IRQn_DMAC_IRQn: IRQn = 6;
#[doc = "<  7 SAMD21E18A Universal Serial Bus (USB)"]
pub const IRQn_USB_IRQn: IRQn = 7;
#[doc = "<  8 SAMD21E18A Event System Interface (EVSYS)"]
pub const IRQn_EVSYS_IRQn: IRQn = 8;
#[doc = "<  9 SAMD21E18A Serial Communication Interface 0 (SERCOM0)"]
pub const IRQn_SERCOM0_IRQn: IRQn = 9;
#[doc = "< 10 SAMD21E18A Serial Communication Interface 1 (SERCOM1)"]
pub const IRQn_SERCOM1_IRQn: IRQn = 10;
#[doc = "< 11 SAMD21E18A Serial Communication Interface 2 (SERCOM2)"]
pub const IRQn_SERCOM2_IRQn: IRQn = 11;
#[doc = "< 12 SAMD21E18A Serial Communication Interface 3 (SERCOM3)"]
pub const IRQn_SERCOM3_IRQn: IRQn = 12;
#[doc = "< 15 SAMD21E18A Timer Counter Control 0 (TCC0)"]
pub const IRQn_TCC0_IRQn: IRQn = 15;
#[doc = "< 16 SAMD21E18A Timer Counter Control 1 (TCC1)"]
pub const IRQn_TCC1_IRQn: IRQn = 16;
#[doc = "< 17 SAMD21E18A Timer Counter Control 2 (TCC2)"]
pub const IRQn_TCC2_IRQn: IRQn = 17;
#[doc = "< 18 SAMD21E18A Basic Timer Counter 3 (TC3)"]
pub const IRQn_TC3_IRQn: IRQn = 18;
#[doc = "< 19 SAMD21E18A Basic Timer Counter 4 (TC4)"]
pub const IRQn_TC4_IRQn: IRQn = 19;
#[doc = "< 20 SAMD21E18A Basic Timer Counter 5 (TC5)"]
pub const IRQn_TC5_IRQn: IRQn = 20;
#[doc = "< 23 SAMD21E18A Analog Digital Converter (ADC)"]
pub const IRQn_ADC_IRQn: IRQn = 23;
#[doc = "< 24 SAMD21E18A Analog Comparators (AC)"]
pub const IRQn_AC_IRQn: IRQn = 24;
#[doc = "< 25 SAMD21E18A Digital Analog Converter (DAC)"]
pub const IRQn_DAC_IRQn: IRQn = 25;
#[doc = "< 26 SAMD21E18A Peripheral Touch Controller (PTC)"]
pub const IRQn_PTC_IRQn: IRQn = 26;
#[doc = "< 27 SAMD21E18A Inter-IC Sound Interface (I2S)"]
pub const IRQn_I2S_IRQn: IRQn = 27;
#[doc = "< Number of peripheral IDs"]
pub const IRQn_PERIPH_COUNT_IRQn: IRQn = 28;
#[doc = " Interrupt Number Definition"]
pub type IRQn = i32;
pub use self::IRQn as IRQn_Type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DeviceVectors {
    pub pvStack: *mut cty::c_void,
    pub pfnReset_Handler: *mut cty::c_void,
    pub pfnNonMaskableInt_Handler: *mut cty::c_void,
    pub pfnHardFault_Handler: *mut cty::c_void,
    pub pvReservedM12: *mut cty::c_void,
    pub pvReservedM11: *mut cty::c_void,
    pub pvReservedM10: *mut cty::c_void,
    pub pvReservedM9: *mut cty::c_void,
    pub pvReservedM8: *mut cty::c_void,
    pub pvReservedM7: *mut cty::c_void,
    pub pvReservedM6: *mut cty::c_void,
    pub pfnSVCall_Handler: *mut cty::c_void,
    pub pvReservedM4: *mut cty::c_void,
    pub pvReservedM3: *mut cty::c_void,
    pub pfnPendSV_Handler: *mut cty::c_void,
    pub pfnSysTick_Handler: *mut cty::c_void,
    pub pfnPM_Handler: *mut cty::c_void,
    pub pfnSYSCTRL_Handler: *mut cty::c_void,
    pub pfnWDT_Handler: *mut cty::c_void,
    pub pfnRTC_Handler: *mut cty::c_void,
    pub pfnEIC_Handler: *mut cty::c_void,
    pub pfnNVMCTRL_Handler: *mut cty::c_void,
    pub pfnDMAC_Handler: *mut cty::c_void,
    pub pfnUSB_Handler: *mut cty::c_void,
    pub pfnEVSYS_Handler: *mut cty::c_void,
    pub pfnSERCOM0_Handler: *mut cty::c_void,
    pub pfnSERCOM1_Handler: *mut cty::c_void,
    pub pfnSERCOM2_Handler: *mut cty::c_void,
    pub pfnSERCOM3_Handler: *mut cty::c_void,
    pub pvReserved13: *mut cty::c_void,
    pub pvReserved14: *mut cty::c_void,
    pub pfnTCC0_Handler: *mut cty::c_void,
    pub pfnTCC1_Handler: *mut cty::c_void,
    pub pfnTCC2_Handler: *mut cty::c_void,
    pub pfnTC3_Handler: *mut cty::c_void,
    pub pfnTC4_Handler: *mut cty::c_void,
    pub pfnTC5_Handler: *mut cty::c_void,
    pub pvReserved21: *mut cty::c_void,
    pub pvReserved22: *mut cty::c_void,
    pub pfnADC_Handler: *mut cty::c_void,
    pub pfnAC_Handler: *mut cty::c_void,
    pub pfnDAC_Handler: *mut cty::c_void,
    pub pfnPTC_Handler: *mut cty::c_void,
    pub pfnI2S_Handler: *mut cty::c_void,
    pub pvReserved28: *mut cty::c_void,
}
#[test]
fn bindgen_test_layout__DeviceVectors() {
    assert_eq!(
        ::core::mem::size_of::<_DeviceVectors>(),
        180usize,
        concat!("Size of: ", stringify!(_DeviceVectors))
    );
    assert_eq!(
        ::core::mem::align_of::<_DeviceVectors>(),
        4usize,
        concat!("Alignment of ", stringify!(_DeviceVectors))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvStack as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvStack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnReset_Handler as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnReset_Handler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnNonMaskableInt_Handler as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnNonMaskableInt_Handler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnHardFault_Handler as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnHardFault_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReservedM12 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM12)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReservedM11 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM11)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReservedM10 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM10)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReservedM9 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM9)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReservedM8 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM8)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReservedM7 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReservedM6 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM6)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnSVCall_Handler as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSVCall_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReservedM4 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReservedM3 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReservedM3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnPendSV_Handler as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnPendSV_Handler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnSysTick_Handler as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSysTick_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnPM_Handler as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnPM_Handler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnSYSCTRL_Handler as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSYSCTRL_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnWDT_Handler as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnWDT_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnRTC_Handler as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnRTC_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnEIC_Handler as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnEIC_Handler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnNVMCTRL_Handler as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnNVMCTRL_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnDMAC_Handler as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnDMAC_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnUSB_Handler as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnUSB_Handler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnEVSYS_Handler as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnEVSYS_Handler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnSERCOM0_Handler as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSERCOM0_Handler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnSERCOM1_Handler as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSERCOM1_Handler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnSERCOM2_Handler as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSERCOM2_Handler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_DeviceVectors>())).pfnSERCOM3_Handler as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnSERCOM3_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReserved13 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReserved13)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReserved14 as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReserved14)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnTCC0_Handler as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnTCC0_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnTCC1_Handler as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnTCC1_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnTCC2_Handler as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnTCC2_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnTC3_Handler as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnTC3_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnTC4_Handler as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnTC4_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnTC5_Handler as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnTC5_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReserved21 as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReserved21)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReserved22 as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReserved22)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnADC_Handler as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnADC_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnAC_Handler as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnAC_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnDAC_Handler as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnDAC_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnPTC_Handler as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnPTC_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pfnI2S_Handler as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pfnI2S_Handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_DeviceVectors>())).pvReserved28 as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_DeviceVectors),
            "::",
            stringify!(pvReserved28)
        )
    );
}
pub type DeviceVectors = _DeviceVectors;
extern "C" {
    pub fn Reset_Handler();
}
extern "C" {
    pub fn NonMaskableInt_Handler();
}
extern "C" {
    pub fn HardFault_Handler();
}
extern "C" {
    pub fn SVCall_Handler();
}
extern "C" {
    pub fn PendSV_Handler();
}
extern "C" {
    pub fn SysTick_Handler();
}
extern "C" {
    pub fn PM_Handler();
}
extern "C" {
    pub fn SYSCTRL_Handler();
}
extern "C" {
    pub fn WDT_Handler();
}
extern "C" {
    pub fn RTC_Handler();
}
extern "C" {
    pub fn EIC_Handler();
}
extern "C" {
    pub fn NVMCTRL_Handler();
}
extern "C" {
    pub fn DMAC_Handler();
}
extern "C" {
    pub fn USB_Handler();
}
extern "C" {
    pub fn EVSYS_Handler();
}
extern "C" {
    pub fn SERCOM0_Handler();
}
extern "C" {
    pub fn SERCOM1_Handler();
}
extern "C" {
    pub fn SERCOM2_Handler();
}
extern "C" {
    pub fn SERCOM3_Handler();
}
extern "C" {
    pub fn TCC0_Handler();
}
extern "C" {
    pub fn TCC1_Handler();
}
extern "C" {
    pub fn TCC2_Handler();
}
extern "C" {
    pub fn TC3_Handler();
}
extern "C" {
    pub fn TC4_Handler();
}
extern "C" {
    pub fn TC5_Handler();
}
extern "C" {
    pub fn ADC_Handler();
}
extern "C" {
    pub fn AC_Handler();
}
extern "C" {
    pub fn DAC_Handler();
}
extern "C" {
    pub fn PTC_Handler();
}
extern "C" {
    pub fn I2S_Handler();
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT32 {
    pub v: u32,
}
#[test]
fn bindgen_test_layout_T_UINT32() {
    assert_eq!(
        ::core::mem::size_of::<T_UINT32>(),
        4usize,
        concat!("Size of: ", stringify!(T_UINT32))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT32>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT32))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<T_UINT32>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT32),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT16_WRITE {
    pub v: u16,
}
#[test]
fn bindgen_test_layout_T_UINT16_WRITE() {
    assert_eq!(
        ::core::mem::size_of::<T_UINT16_WRITE>(),
        2usize,
        concat!("Size of: ", stringify!(T_UINT16_WRITE))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT16_WRITE>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT16_WRITE))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<T_UINT16_WRITE>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT16_WRITE),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT16_READ {
    pub v: u16,
}
#[test]
fn bindgen_test_layout_T_UINT16_READ() {
    assert_eq!(
        ::core::mem::size_of::<T_UINT16_READ>(),
        2usize,
        concat!("Size of: ", stringify!(T_UINT16_READ))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT16_READ>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT16_READ))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<T_UINT16_READ>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT16_READ),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT32_WRITE {
    pub v: u32,
}
#[test]
fn bindgen_test_layout_T_UINT32_WRITE() {
    assert_eq!(
        ::core::mem::size_of::<T_UINT32_WRITE>(),
        4usize,
        concat!("Size of: ", stringify!(T_UINT32_WRITE))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT32_WRITE>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT32_WRITE))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<T_UINT32_WRITE>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT32_WRITE),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT32_READ {
    pub v: u32,
}
#[test]
fn bindgen_test_layout_T_UINT32_READ() {
    assert_eq!(
        ::core::mem::size_of::<T_UINT32_READ>(),
        4usize,
        concat!("Size of: ", stringify!(T_UINT32_READ))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT32_READ>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT32_READ))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<T_UINT32_READ>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT32_READ),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union APSR_Type {
    pub b: APSR_Type__bindgen_ty_1,
    pub w: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct APSR_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
}
#[test]
fn bindgen_test_layout_APSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<APSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(APSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<APSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(APSR_Type__bindgen_ty_1))
    );
}
impl APSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 28u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 28u8, val as u64)
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        _reserved0: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 28u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::core::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::core::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::core::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::core::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_APSR_Type() {
    assert_eq!(
        ::core::mem::size_of::<APSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(APSR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<APSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(APSR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<APSR_Type>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(APSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<APSR_Type>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(APSR_Type),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union IPSR_Type {
    pub b: IPSR_Type__bindgen_ty_1,
    pub w: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct IPSR_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
}
#[test]
fn bindgen_test_layout_IPSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<IPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(IPSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<IPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(IPSR_Type__bindgen_ty_1))
    );
}
impl IPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 23u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 23u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(ISR: u32, _reserved0: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::core::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 23u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_IPSR_Type() {
    assert_eq!(
        ::core::mem::size_of::<IPSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(IPSR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<IPSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(IPSR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IPSR_Type>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IPSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IPSR_Type>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IPSR_Type),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xPSR_Type {
    pub b: xPSR_Type__bindgen_ty_1,
    pub w: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct xPSR_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
}
#[test]
fn bindgen_test_layout_xPSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<xPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(xPSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<xPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(xPSR_Type__bindgen_ty_1))
    );
}
impl xPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 15u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub fn T(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_T(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ISR: u32,
        _reserved0: u32,
        T: u32,
        _reserved1: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::core::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 15u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let T: u32 = unsafe { ::core::mem::transmute(T) };
            T as u64
        });
        __bindgen_bitfield_unit.set(25usize, 3u8, {
            let _reserved1: u32 = unsafe { ::core::mem::transmute(_reserved1) };
            _reserved1 as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::core::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::core::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::core::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::core::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_xPSR_Type() {
    assert_eq!(
        ::core::mem::size_of::<xPSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(xPSR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<xPSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(xPSR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xPSR_Type>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xPSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xPSR_Type>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xPSR_Type),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CONTROL_Type {
    pub b: CONTROL_Type__bindgen_ty_1,
    pub w: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct CONTROL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
}
#[test]
fn bindgen_test_layout_CONTROL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<CONTROL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(CONTROL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<CONTROL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(CONTROL_Type__bindgen_ty_1))
    );
}
impl CONTROL_Type__bindgen_ty_1 {
    #[inline]
    pub fn nPRIV(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nPRIV(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SPSEL(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SPSEL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        nPRIV: u32,
        SPSEL: u32,
        _reserved1: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let nPRIV: u32 = unsafe { ::core::mem::transmute(nPRIV) };
            nPRIV as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let SPSEL: u32 = unsafe { ::core::mem::transmute(SPSEL) };
            SPSEL as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let _reserved1: u32 = unsafe { ::core::mem::transmute(_reserved1) };
            _reserved1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_CONTROL_Type() {
    assert_eq!(
        ::core::mem::size_of::<CONTROL_Type>(),
        4usize,
        concat!("Size of: ", stringify!(CONTROL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<CONTROL_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(CONTROL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CONTROL_Type>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CONTROL_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CONTROL_Type>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CONTROL_Type),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NVIC_Type {
    pub ISER: [u32; 1usize],
    pub RESERVED0: [u32; 31usize],
    pub ICER: [u32; 1usize],
    pub RSERVED1: [u32; 31usize],
    pub ISPR: [u32; 1usize],
    pub RESERVED2: [u32; 31usize],
    pub ICPR: [u32; 1usize],
    pub RESERVED3: [u32; 31usize],
    pub RESERVED4: [u32; 64usize],
    pub IP: [u32; 8usize],
}
#[test]
fn bindgen_test_layout_NVIC_Type() {
    assert_eq!(
        ::core::mem::size_of::<NVIC_Type>(),
        800usize,
        concat!("Size of: ", stringify!(NVIC_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<NVIC_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(NVIC_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).ISER as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ISER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED0 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).ICER as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ICER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RSERVED1 as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RSERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).ISPR as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ISPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED2 as *const _ as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).ICPR as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ICPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED3 as *const _ as usize },
        388usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED4 as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).IP as *const _ as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(IP)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCB_Type {
    pub CPUID: u32,
    pub ICSR: u32,
    pub VTOR: u32,
    pub AIRCR: u32,
    pub SCR: u32,
    pub CCR: u32,
    pub RESERVED1: u32,
    pub SHP: [u32; 2usize],
    pub SHCSR: u32,
}
#[test]
fn bindgen_test_layout_SCB_Type() {
    assert_eq!(
        ::core::mem::size_of::<SCB_Type>(),
        40usize,
        concat!("Size of: ", stringify!(SCB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<SCB_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SCB_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).CPUID as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CPUID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).ICSR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(ICSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).VTOR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(VTOR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).AIRCR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(AIRCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).SCR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).CCR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).RESERVED1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).SHP as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SHP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).SHCSR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SHCSR)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SysTick_Type {
    pub CTRL: u32,
    pub LOAD: u32,
    pub VAL: u32,
    pub CALIB: u32,
}
#[test]
fn bindgen_test_layout_SysTick_Type() {
    assert_eq!(
        ::core::mem::size_of::<SysTick_Type>(),
        16usize,
        concat!("Size of: ", stringify!(SysTick_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<SysTick_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SysTick_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SysTick_Type>())).CTRL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SysTick_Type>())).LOAD as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(LOAD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SysTick_Type>())).VAL as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(VAL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SysTick_Type>())).CALIB as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(CALIB)
        )
    );
}
extern "C" {
    pub static mut SystemCoreClock: u32;
}
extern "C" {
    pub fn SystemInit();
}
extern "C" {
    pub fn SystemCoreClockUpdate();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_CTRLA_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_CTRLA_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_CTRLA_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_CTRLA_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_CTRLA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_CTRLA_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_CTRLA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_CTRLA_Type__bindgen_ty_1))
    );
}
impl AC_CTRLA_Type__bindgen_ty_1 {
    #[inline]
    pub fn SWRST(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SWRST(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ENABLE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ENABLE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn RUNSTDBY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RUNSTDBY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LPMUX(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_LPMUX(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SWRST: u8,
        ENABLE: u8,
        RUNSTDBY: u8,
        LPMUX: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let SWRST: u8 = unsafe { ::core::mem::transmute(SWRST) };
            SWRST as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ENABLE: u8 = unsafe { ::core::mem::transmute(ENABLE) };
            ENABLE as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let RUNSTDBY: u8 = unsafe { ::core::mem::transmute(RUNSTDBY) };
            RUNSTDBY as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let LPMUX: u8 = unsafe { ::core::mem::transmute(LPMUX) };
            LPMUX as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_CTRLA_Type() {
    assert_eq!(
        ::core::mem::size_of::<AC_CTRLA_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_CTRLA_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_CTRLA_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_CTRLA_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_CTRLA_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_CTRLA_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_CTRLA_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_CTRLA_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_CTRLB_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_CTRLB_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_CTRLB_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_CTRLB_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_CTRLB_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_CTRLB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_CTRLB_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_CTRLB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_CTRLB_Type__bindgen_ty_1))
    );
}
impl AC_CTRLB_Type__bindgen_ty_1 {
    #[inline]
    pub fn START0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_START0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn START1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_START1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(START0: u8, START1: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let START0: u8 = unsafe { ::core::mem::transmute(START0) };
            START0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let START1: u8 = unsafe { ::core::mem::transmute(START1) };
            START1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_CTRLB_Type__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_CTRLB_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_CTRLB_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_CTRLB_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_CTRLB_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_CTRLB_Type__bindgen_ty_2))
    );
}
impl AC_CTRLB_Type__bindgen_ty_2 {
    #[inline]
    pub fn START(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_START(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(START: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let START: u8 = unsafe { ::core::mem::transmute(START) };
            START as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_CTRLB_Type() {
    assert_eq!(
        ::core::mem::size_of::<AC_CTRLB_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_CTRLB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_CTRLB_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_CTRLB_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_CTRLB_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_CTRLB_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_CTRLB_Type>())).vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_CTRLB_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_CTRLB_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_CTRLB_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_EVCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_EVCTRL_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_EVCTRL_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct AC_EVCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_EVCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_EVCTRL_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(AC_EVCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_EVCTRL_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(AC_EVCTRL_Type__bindgen_ty_1))
    );
}
impl AC_EVCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn COMPEO0(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_COMPEO0(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMPEO1(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_COMPEO1(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINEO0(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_WINEO0(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMPEI0(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_COMPEI0(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMPEI1(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_COMPEI1(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        COMPEO0: u16,
        COMPEO1: u16,
        WINEO0: u16,
        COMPEI0: u16,
        COMPEI1: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let COMPEO0: u16 = unsafe { ::core::mem::transmute(COMPEO0) };
            COMPEO0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let COMPEO1: u16 = unsafe { ::core::mem::transmute(COMPEO1) };
            COMPEO1 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WINEO0: u16 = unsafe { ::core::mem::transmute(WINEO0) };
            WINEO0 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let COMPEI0: u16 = unsafe { ::core::mem::transmute(COMPEI0) };
            COMPEI0 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let COMPEI1: u16 = unsafe { ::core::mem::transmute(COMPEI1) };
            COMPEI1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct AC_EVCTRL_Type__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_EVCTRL_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_EVCTRL_Type__bindgen_ty_2>(),
        2usize,
        concat!("Size of: ", stringify!(AC_EVCTRL_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_EVCTRL_Type__bindgen_ty_2>(),
        2usize,
        concat!("Alignment of ", stringify!(AC_EVCTRL_Type__bindgen_ty_2))
    );
}
impl AC_EVCTRL_Type__bindgen_ty_2 {
    #[inline]
    pub fn COMPEO(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_COMPEO(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn WINEO(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_WINEO(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMPEI(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_COMPEI(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        COMPEO: u16,
        WINEO: u16,
        COMPEI: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let COMPEO: u16 = unsafe { ::core::mem::transmute(COMPEO) };
            COMPEO as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WINEO: u16 = unsafe { ::core::mem::transmute(WINEO) };
            WINEO as u64
        });
        __bindgen_bitfield_unit.set(8usize, 2u8, {
            let COMPEI: u16 = unsafe { ::core::mem::transmute(COMPEI) };
            COMPEI as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_EVCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<AC_EVCTRL_Type>(),
        2usize,
        concat!("Size of: ", stringify!(AC_EVCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_EVCTRL_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(AC_EVCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_EVCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_EVCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_EVCTRL_Type>())).vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_EVCTRL_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_EVCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_EVCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_INTENCLR_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_INTENCLR_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_INTENCLR_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_INTENCLR_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_INTENCLR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTENCLR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTENCLR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTENCLR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTENCLR_Type__bindgen_ty_1))
    );
}
impl AC_INTENCLR_Type__bindgen_ty_1 {
    #[inline]
    pub fn COMP0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_COMP0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMP1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_COMP1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WIN0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WIN0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        COMP0: u8,
        COMP1: u8,
        WIN0: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let COMP0: u8 = unsafe { ::core::mem::transmute(COMP0) };
            COMP0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let COMP1: u8 = unsafe { ::core::mem::transmute(COMP1) };
            COMP1 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WIN0: u8 = unsafe { ::core::mem::transmute(WIN0) };
            WIN0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_INTENCLR_Type__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_INTENCLR_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTENCLR_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTENCLR_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTENCLR_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTENCLR_Type__bindgen_ty_2))
    );
}
impl AC_INTENCLR_Type__bindgen_ty_2 {
    #[inline]
    pub fn COMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_COMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn WIN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WIN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(COMP: u8, WIN: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let COMP: u8 = unsafe { ::core::mem::transmute(COMP) };
            COMP as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WIN: u8 = unsafe { ::core::mem::transmute(WIN) };
            WIN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_INTENCLR_Type() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTENCLR_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTENCLR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTENCLR_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTENCLR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_INTENCLR_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTENCLR_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_INTENCLR_Type>())).vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTENCLR_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_INTENCLR_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTENCLR_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_INTENSET_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_INTENSET_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_INTENSET_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_INTENSET_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_INTENSET_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTENSET_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTENSET_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTENSET_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTENSET_Type__bindgen_ty_1))
    );
}
impl AC_INTENSET_Type__bindgen_ty_1 {
    #[inline]
    pub fn COMP0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_COMP0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMP1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_COMP1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WIN0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WIN0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        COMP0: u8,
        COMP1: u8,
        WIN0: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let COMP0: u8 = unsafe { ::core::mem::transmute(COMP0) };
            COMP0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let COMP1: u8 = unsafe { ::core::mem::transmute(COMP1) };
            COMP1 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WIN0: u8 = unsafe { ::core::mem::transmute(WIN0) };
            WIN0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_INTENSET_Type__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_INTENSET_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTENSET_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTENSET_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTENSET_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTENSET_Type__bindgen_ty_2))
    );
}
impl AC_INTENSET_Type__bindgen_ty_2 {
    #[inline]
    pub fn COMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_COMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn WIN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WIN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(COMP: u8, WIN: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let COMP: u8 = unsafe { ::core::mem::transmute(COMP) };
            COMP as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WIN: u8 = unsafe { ::core::mem::transmute(WIN) };
            WIN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_INTENSET_Type() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTENSET_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTENSET_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTENSET_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTENSET_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_INTENSET_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTENSET_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_INTENSET_Type>())).vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTENSET_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_INTENSET_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTENSET_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_INTFLAG_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_INTFLAG_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_INTFLAG_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_INTFLAG_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_INTFLAG_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTFLAG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTFLAG_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTFLAG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTFLAG_Type__bindgen_ty_1))
    );
}
impl AC_INTFLAG_Type__bindgen_ty_1 {
    #[inline]
    pub fn COMP0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_COMP0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn COMP1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_COMP1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WIN0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WIN0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        COMP0: u8,
        COMP1: u8,
        WIN0: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let COMP0: u8 = unsafe { ::core::mem::transmute(COMP0) };
            COMP0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let COMP1: u8 = unsafe { ::core::mem::transmute(COMP1) };
            COMP1 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WIN0: u8 = unsafe { ::core::mem::transmute(WIN0) };
            WIN0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_INTFLAG_Type__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_INTFLAG_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTFLAG_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTFLAG_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTFLAG_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTFLAG_Type__bindgen_ty_2))
    );
}
impl AC_INTFLAG_Type__bindgen_ty_2 {
    #[inline]
    pub fn COMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_COMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn WIN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WIN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(COMP: u8, WIN: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let COMP: u8 = unsafe { ::core::mem::transmute(COMP) };
            COMP as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let WIN: u8 = unsafe { ::core::mem::transmute(WIN) };
            WIN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_INTFLAG_Type() {
    assert_eq!(
        ::core::mem::size_of::<AC_INTFLAG_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_INTFLAG_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_INTFLAG_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_INTFLAG_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_INTFLAG_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTFLAG_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_INTFLAG_Type>())).vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTFLAG_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_INTFLAG_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_INTFLAG_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_STATUSA_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_STATUSA_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_STATUSA_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_STATUSA_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_STATUSA_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSA_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSA_Type__bindgen_ty_1))
    );
}
impl AC_STATUSA_Type__bindgen_ty_1 {
    #[inline]
    pub fn STATE0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_STATE0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn STATE1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_STATE1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WSTATE0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_WSTATE0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        STATE0: u8,
        STATE1: u8,
        WSTATE0: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let STATE0: u8 = unsafe { ::core::mem::transmute(STATE0) };
            STATE0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let STATE1: u8 = unsafe { ::core::mem::transmute(STATE1) };
            STATE1 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let WSTATE0: u8 = unsafe { ::core::mem::transmute(WSTATE0) };
            WSTATE0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_STATUSA_Type__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_STATUSA_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSA_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSA_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSA_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSA_Type__bindgen_ty_2))
    );
}
impl AC_STATUSA_Type__bindgen_ty_2 {
    #[inline]
    pub fn STATE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_STATE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(STATE: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let STATE: u8 = unsafe { ::core::mem::transmute(STATE) };
            STATE as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_STATUSA_Type() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSA_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSA_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSA_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSA_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_STATUSA_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSA_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_STATUSA_Type>())).vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSA_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_STATUSA_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSA_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_STATUSB_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_STATUSB_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_STATUSB_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_STATUSB_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_STATUSB_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSB_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSB_Type__bindgen_ty_1))
    );
}
impl AC_STATUSB_Type__bindgen_ty_1 {
    #[inline]
    pub fn READY0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_READY0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn READY1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_READY1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SYNCBUSY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SYNCBUSY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        READY0: u8,
        READY1: u8,
        SYNCBUSY: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let READY0: u8 = unsafe { ::core::mem::transmute(READY0) };
            READY0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let READY1: u8 = unsafe { ::core::mem::transmute(READY1) };
            READY1 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let SYNCBUSY: u8 = unsafe { ::core::mem::transmute(SYNCBUSY) };
            SYNCBUSY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_STATUSB_Type__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_STATUSB_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSB_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSB_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSB_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSB_Type__bindgen_ty_2))
    );
}
impl AC_STATUSB_Type__bindgen_ty_2 {
    #[inline]
    pub fn READY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_READY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(READY: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let READY: u8 = unsafe { ::core::mem::transmute(READY) };
            READY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_STATUSB_Type() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSB_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSB_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSB_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_STATUSB_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSB_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_STATUSB_Type>())).vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSB_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_STATUSB_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSB_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_STATUSC_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_STATUSC_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: AC_STATUSC_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_STATUSC_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_STATUSC_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSC_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSC_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSC_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSC_Type__bindgen_ty_1))
    );
}
impl AC_STATUSC_Type__bindgen_ty_1 {
    #[inline]
    pub fn STATE0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_STATE0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn STATE1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_STATE1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WSTATE0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_WSTATE0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        STATE0: u8,
        STATE1: u8,
        WSTATE0: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let STATE0: u8 = unsafe { ::core::mem::transmute(STATE0) };
            STATE0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let STATE1: u8 = unsafe { ::core::mem::transmute(STATE1) };
            STATE1 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let WSTATE0: u8 = unsafe { ::core::mem::transmute(WSTATE0) };
            WSTATE0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_STATUSC_Type__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_STATUSC_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSC_Type__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSC_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSC_Type__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSC_Type__bindgen_ty_2))
    );
}
impl AC_STATUSC_Type__bindgen_ty_2 {
    #[inline]
    pub fn STATE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_STATE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(STATE: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let STATE: u8 = unsafe { ::core::mem::transmute(STATE) };
            STATE as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_STATUSC_Type() {
    assert_eq!(
        ::core::mem::size_of::<AC_STATUSC_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_STATUSC_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_STATUSC_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_STATUSC_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_STATUSC_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSC_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_STATUSC_Type>())).vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSC_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_STATUSC_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_STATUSC_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_WINCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_WINCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_WINCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_WINCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_WINCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_WINCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_WINCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_WINCTRL_Type__bindgen_ty_1))
    );
}
impl AC_WINCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn WEN0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WEN0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINTSEL0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_WINTSEL0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(WEN0: u8, WINTSEL0: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let WEN0: u8 = unsafe { ::core::mem::transmute(WEN0) };
            WEN0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 2u8, {
            let WINTSEL0: u8 = unsafe { ::core::mem::transmute(WINTSEL0) };
            WINTSEL0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_WINCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<AC_WINCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_WINCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_WINCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_WINCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_WINCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_WINCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_WINCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_WINCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_COMPCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_COMPCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct AC_COMPCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_COMPCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_COMPCTRL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(AC_COMPCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_COMPCTRL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(AC_COMPCTRL_Type__bindgen_ty_1))
    );
}
impl AC_COMPCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn ENABLE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ENABLE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SINGLE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SINGLE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SPEED(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_SPEED(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn INTSEL(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_INTSEL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn MUXNEG(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_MUXNEG(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn MUXPOS(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_MUXPOS(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn SWAP(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWAP(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn OUT(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_OUT(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn HYST(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_HYST(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FLEN(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_FLEN(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ENABLE: u32,
        SINGLE: u32,
        SPEED: u32,
        INTSEL: u32,
        MUXNEG: u32,
        MUXPOS: u32,
        SWAP: u32,
        OUT: u32,
        HYST: u32,
        FLEN: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ENABLE: u32 = unsafe { ::core::mem::transmute(ENABLE) };
            ENABLE as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let SINGLE: u32 = unsafe { ::core::mem::transmute(SINGLE) };
            SINGLE as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let SPEED: u32 = unsafe { ::core::mem::transmute(SPEED) };
            SPEED as u64
        });
        __bindgen_bitfield_unit.set(5usize, 2u8, {
            let INTSEL: u32 = unsafe { ::core::mem::transmute(INTSEL) };
            INTSEL as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let MUXNEG: u32 = unsafe { ::core::mem::transmute(MUXNEG) };
            MUXNEG as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let MUXPOS: u32 = unsafe { ::core::mem::transmute(MUXPOS) };
            MUXPOS as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let SWAP: u32 = unsafe { ::core::mem::transmute(SWAP) };
            SWAP as u64
        });
        __bindgen_bitfield_unit.set(16usize, 2u8, {
            let OUT: u32 = unsafe { ::core::mem::transmute(OUT) };
            OUT as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let HYST: u32 = unsafe { ::core::mem::transmute(HYST) };
            HYST as u64
        });
        __bindgen_bitfield_unit.set(24usize, 3u8, {
            let FLEN: u32 = unsafe { ::core::mem::transmute(FLEN) };
            FLEN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_COMPCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<AC_COMPCTRL_Type>(),
        4usize,
        concat!("Size of: ", stringify!(AC_COMPCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_COMPCTRL_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AC_COMPCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_COMPCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_COMPCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_COMPCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_COMPCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union AC_SCALER_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: AC_SCALER_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AC_SCALER_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_AC_SCALER_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AC_SCALER_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(AC_SCALER_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_SCALER_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_SCALER_Type__bindgen_ty_1))
    );
}
impl AC_SCALER_Type__bindgen_ty_1 {
    #[inline]
    pub fn VALUE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_VALUE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(VALUE: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 6u8, {
            let VALUE: u8 = unsafe { ::core::mem::transmute(VALUE) };
            VALUE as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_AC_SCALER_Type() {
    assert_eq!(
        ::core::mem::size_of::<AC_SCALER_Type>(),
        1usize,
        concat!("Size of: ", stringify!(AC_SCALER_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<AC_SCALER_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(AC_SCALER_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_SCALER_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_SCALER_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AC_SCALER_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AC_SCALER_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Ac {
    #[doc = "< \\brief Offset: 0x00 (R/W  8) Control A"]
    pub CTRLA: AC_CTRLA_Type,
    #[doc = "< \\brief Offset: 0x01 ( /W  8) Control B"]
    pub CTRLB: AC_CTRLB_Type,
    #[doc = "< \\brief Offset: 0x02 (R/W 16) Event Control"]
    pub EVCTRL: AC_EVCTRL_Type,
    #[doc = "< \\brief Offset: 0x04 (R/W  8) Interrupt Enable Clear"]
    pub INTENCLR: AC_INTENCLR_Type,
    #[doc = "< \\brief Offset: 0x05 (R/W  8) Interrupt Enable Set"]
    pub INTENSET: AC_INTENSET_Type,
    #[doc = "< \\brief Offset: 0x06 (R/W  8) Interrupt Flag Status and Clear"]
    pub INTFLAG: AC_INTFLAG_Type,
    pub Reserved1: [RoReg8; 1usize],
    #[doc = "< \\brief Offset: 0x08 (R/   8) Status A"]
    pub STATUSA: AC_STATUSA_Type,
    #[doc = "< \\brief Offset: 0x09 (R/   8) Status B"]
    pub STATUSB: AC_STATUSB_Type,
    #[doc = "< \\brief Offset: 0x0A (R/   8) Status C"]
    pub STATUSC: AC_STATUSC_Type,
    pub Reserved2: [RoReg8; 1usize],
    #[doc = "< \\brief Offset: 0x0C (R/W  8) Window Control"]
    pub WINCTRL: AC_WINCTRL_Type,
    pub Reserved3: [RoReg8; 3usize],
    #[doc = "< \\brief Offset: 0x10 (R/W 32) Comparator Control n"]
    pub COMPCTRL: [AC_COMPCTRL_Type; 2usize],
    pub Reserved4: [RoReg8; 8usize],
    #[doc = "< \\brief Offset: 0x20 (R/W  8) Scaler n"]
    pub SCALER: [AC_SCALER_Type; 2usize],
}
#[test]
fn bindgen_test_layout_Ac() {
    assert_eq!(
        ::core::mem::size_of::<Ac>(),
        36usize,
        concat!("Size of: ", stringify!(Ac))
    );
    assert_eq!(
        ::core::mem::align_of::<Ac>(),
        4usize,
        concat!("Alignment of ", stringify!(Ac))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).CTRLA as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Ac), "::", stringify!(CTRLA))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).CTRLB as *const _ as usize },
        1usize,
        concat!("Offset of field: ", stringify!(Ac), "::", stringify!(CTRLB))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).EVCTRL as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(EVCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).INTENCLR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(INTENCLR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).INTENSET as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(INTENSET)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).INTFLAG as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(INTFLAG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).Reserved1 as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(Reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).STATUSA as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(STATUSA)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).STATUSB as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(STATUSB)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).STATUSC as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(STATUSC)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).Reserved2 as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(Reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).WINCTRL as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(WINCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).Reserved3 as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(Reserved3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).COMPCTRL as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(COMPCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).Reserved4 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(Reserved4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Ac>())).SCALER as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Ac),
            "::",
            stringify!(SCALER)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_CTRLA_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_CTRLA_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_CTRLA_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_CTRLA_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_CTRLA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_CTRLA_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CTRLA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_CTRLA_Type__bindgen_ty_1))
    );
}
impl ADC_CTRLA_Type__bindgen_ty_1 {
    #[inline]
    pub fn SWRST(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SWRST(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ENABLE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ENABLE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn RUNSTDBY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RUNSTDBY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SWRST: u8,
        ENABLE: u8,
        RUNSTDBY: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let SWRST: u8 = unsafe { ::core::mem::transmute(SWRST) };
            SWRST as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ENABLE: u8 = unsafe { ::core::mem::transmute(ENABLE) };
            ENABLE as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let RUNSTDBY: u8 = unsafe { ::core::mem::transmute(RUNSTDBY) };
            RUNSTDBY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_CTRLA_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_CTRLA_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_CTRLA_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CTRLA_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_CTRLA_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_CTRLA_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CTRLA_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_CTRLA_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CTRLA_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_REFCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_REFCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_REFCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_REFCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_REFCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_REFCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_REFCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_REFCTRL_Type__bindgen_ty_1))
    );
}
impl ADC_REFCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn REFSEL(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_REFSEL(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn REFCOMP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_REFCOMP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(REFSEL: u8, REFCOMP: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let REFSEL: u8 = unsafe { ::core::mem::transmute(REFSEL) };
            REFSEL as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let REFCOMP: u8 = unsafe { ::core::mem::transmute(REFCOMP) };
            REFCOMP as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_REFCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_REFCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_REFCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_REFCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_REFCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_REFCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_REFCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_REFCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_REFCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_AVGCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_AVGCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_AVGCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_AVGCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_AVGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_AVGCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_AVGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_AVGCTRL_Type__bindgen_ty_1))
    );
}
impl ADC_AVGCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn SAMPLENUM(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_SAMPLENUM(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn ADJRES(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_ADJRES(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(SAMPLENUM: u8, ADJRES: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let SAMPLENUM: u8 = unsafe { ::core::mem::transmute(SAMPLENUM) };
            SAMPLENUM as u64
        });
        __bindgen_bitfield_unit.set(4usize, 3u8, {
            let ADJRES: u8 = unsafe { ::core::mem::transmute(ADJRES) };
            ADJRES as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_AVGCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_AVGCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_AVGCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_AVGCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_AVGCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_AVGCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_AVGCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_AVGCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_AVGCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_SAMPCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_SAMPCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_SAMPCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_SAMPCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_SAMPCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_SAMPCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SAMPCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_SAMPCTRL_Type__bindgen_ty_1))
    );
}
impl ADC_SAMPCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn SAMPLEN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_SAMPLEN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(SAMPLEN: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 6u8, {
            let SAMPLEN: u8 = unsafe { ::core::mem::transmute(SAMPLEN) };
            SAMPLEN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_SAMPCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_SAMPCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_SAMPCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SAMPCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_SAMPCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_SAMPCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SAMPCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_SAMPCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SAMPCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_CTRLB_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_CTRLB_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_CTRLB_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_CTRLB_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_CTRLB_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_CTRLB_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CTRLB_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_CTRLB_Type__bindgen_ty_1))
    );
}
impl ADC_CTRLB_Type__bindgen_ty_1 {
    #[inline]
    pub fn DIFFMODE(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_DIFFMODE(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LEFTADJ(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_LEFTADJ(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FREERUN(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_FREERUN(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CORREN(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_CORREN(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn RESSEL(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_RESSEL(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn PRESCALER(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_PRESCALER(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        DIFFMODE: u16,
        LEFTADJ: u16,
        FREERUN: u16,
        CORREN: u16,
        RESSEL: u16,
        PRESCALER: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let DIFFMODE: u16 = unsafe { ::core::mem::transmute(DIFFMODE) };
            DIFFMODE as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let LEFTADJ: u16 = unsafe { ::core::mem::transmute(LEFTADJ) };
            LEFTADJ as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let FREERUN: u16 = unsafe { ::core::mem::transmute(FREERUN) };
            FREERUN as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let CORREN: u16 = unsafe { ::core::mem::transmute(CORREN) };
            CORREN as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let RESSEL: u16 = unsafe { ::core::mem::transmute(RESSEL) };
            RESSEL as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let PRESCALER: u16 = unsafe { ::core::mem::transmute(PRESCALER) };
            PRESCALER as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_CTRLB_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_CTRLB_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_CTRLB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CTRLB_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_CTRLB_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_CTRLB_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CTRLB_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_CTRLB_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CTRLB_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_WINCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_WINCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_WINCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_WINCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_WINCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_WINCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_WINCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_WINCTRL_Type__bindgen_ty_1))
    );
}
impl ADC_WINCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn WINMODE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_WINMODE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(WINMODE: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let WINMODE: u8 = unsafe { ::core::mem::transmute(WINMODE) };
            WINMODE as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_WINCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_WINCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_WINCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_WINCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_WINCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_WINCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_WINCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_WINCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_WINCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_SWTRIG_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_SWTRIG_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_SWTRIG_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_SWTRIG_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_SWTRIG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_SWTRIG_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SWTRIG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_SWTRIG_Type__bindgen_ty_1))
    );
}
impl ADC_SWTRIG_Type__bindgen_ty_1 {
    #[inline]
    pub fn FLUSH(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_FLUSH(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn START(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_START(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(FLUSH: u8, START: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let FLUSH: u8 = unsafe { ::core::mem::transmute(FLUSH) };
            FLUSH as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let START: u8 = unsafe { ::core::mem::transmute(START) };
            START as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_SWTRIG_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_SWTRIG_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_SWTRIG_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_SWTRIG_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_SWTRIG_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_SWTRIG_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SWTRIG_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_SWTRIG_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_SWTRIG_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_INPUTCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_INPUTCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_INPUTCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_INPUTCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_INPUTCTRL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ADC_INPUTCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INPUTCTRL_Type__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ADC_INPUTCTRL_Type__bindgen_ty_1)
        )
    );
}
impl ADC_INPUTCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn MUXPOS(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_MUXPOS(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn MUXNEG(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_MUXNEG(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn INPUTSCAN(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_INPUTSCAN(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn INPUTOFFSET(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_INPUTOFFSET(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn GAIN(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_GAIN(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        MUXPOS: u32,
        MUXNEG: u32,
        INPUTSCAN: u32,
        INPUTOFFSET: u32,
        GAIN: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let MUXPOS: u32 = unsafe { ::core::mem::transmute(MUXPOS) };
            MUXPOS as u64
        });
        __bindgen_bitfield_unit.set(8usize, 5u8, {
            let MUXNEG: u32 = unsafe { ::core::mem::transmute(MUXNEG) };
            MUXNEG as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let INPUTSCAN: u32 = unsafe { ::core::mem::transmute(INPUTSCAN) };
            INPUTSCAN as u64
        });
        __bindgen_bitfield_unit.set(20usize, 4u8, {
            let INPUTOFFSET: u32 = unsafe { ::core::mem::transmute(INPUTOFFSET) };
            INPUTOFFSET as u64
        });
        __bindgen_bitfield_unit.set(24usize, 4u8, {
            let GAIN: u32 = unsafe { ::core::mem::transmute(GAIN) };
            GAIN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_INPUTCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_INPUTCTRL_Type>(),
        4usize,
        concat!("Size of: ", stringify!(ADC_INPUTCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INPUTCTRL_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_INPUTCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_INPUTCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INPUTCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_INPUTCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INPUTCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_EVCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_EVCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_EVCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_EVCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_EVCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_EVCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_EVCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_EVCTRL_Type__bindgen_ty_1))
    );
}
impl ADC_EVCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn STARTEI(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_STARTEI(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SYNCEI(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SYNCEI(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn RESRDYEO(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RESRDYEO(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINMONEO(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WINMONEO(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        STARTEI: u8,
        SYNCEI: u8,
        RESRDYEO: u8,
        WINMONEO: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let STARTEI: u8 = unsafe { ::core::mem::transmute(STARTEI) };
            STARTEI as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let SYNCEI: u8 = unsafe { ::core::mem::transmute(SYNCEI) };
            SYNCEI as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let RESRDYEO: u8 = unsafe { ::core::mem::transmute(RESRDYEO) };
            RESRDYEO as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let WINMONEO: u8 = unsafe { ::core::mem::transmute(WINMONEO) };
            WINMONEO as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_EVCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_EVCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_EVCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_EVCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_EVCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_EVCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_EVCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_EVCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_EVCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_INTENCLR_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_INTENCLR_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_INTENCLR_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_INTENCLR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_INTENCLR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_INTENCLR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INTENCLR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_INTENCLR_Type__bindgen_ty_1))
    );
}
impl ADC_INTENCLR_Type__bindgen_ty_1 {
    #[inline]
    pub fn RESRDY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RESRDY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn OVERRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_OVERRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINMON(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WINMON(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SYNCRDY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SYNCRDY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        RESRDY: u8,
        OVERRUN: u8,
        WINMON: u8,
        SYNCRDY: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let RESRDY: u8 = unsafe { ::core::mem::transmute(RESRDY) };
            RESRDY as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let OVERRUN: u8 = unsafe { ::core::mem::transmute(OVERRUN) };
            OVERRUN as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let WINMON: u8 = unsafe { ::core::mem::transmute(WINMON) };
            WINMON as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let SYNCRDY: u8 = unsafe { ::core::mem::transmute(SYNCRDY) };
            SYNCRDY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_INTENCLR_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_INTENCLR_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_INTENCLR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INTENCLR_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_INTENCLR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_INTENCLR_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INTENCLR_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_INTENCLR_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INTENCLR_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_INTENSET_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_INTENSET_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_INTENSET_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_INTENSET_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_INTENSET_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_INTENSET_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INTENSET_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_INTENSET_Type__bindgen_ty_1))
    );
}
impl ADC_INTENSET_Type__bindgen_ty_1 {
    #[inline]
    pub fn RESRDY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RESRDY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn OVERRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_OVERRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINMON(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WINMON(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SYNCRDY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SYNCRDY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        RESRDY: u8,
        OVERRUN: u8,
        WINMON: u8,
        SYNCRDY: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let RESRDY: u8 = unsafe { ::core::mem::transmute(RESRDY) };
            RESRDY as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let OVERRUN: u8 = unsafe { ::core::mem::transmute(OVERRUN) };
            OVERRUN as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let WINMON: u8 = unsafe { ::core::mem::transmute(WINMON) };
            WINMON as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let SYNCRDY: u8 = unsafe { ::core::mem::transmute(SYNCRDY) };
            SYNCRDY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_INTENSET_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_INTENSET_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_INTENSET_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INTENSET_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_INTENSET_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_INTENSET_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INTENSET_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_INTENSET_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INTENSET_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_INTFLAG_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_INTFLAG_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_INTFLAG_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_INTFLAG_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_INTFLAG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_INTFLAG_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INTFLAG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_INTFLAG_Type__bindgen_ty_1))
    );
}
impl ADC_INTFLAG_Type__bindgen_ty_1 {
    #[inline]
    pub fn RESRDY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RESRDY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn OVERRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_OVERRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn WINMON(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_WINMON(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SYNCRDY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SYNCRDY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        RESRDY: u8,
        OVERRUN: u8,
        WINMON: u8,
        SYNCRDY: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let RESRDY: u8 = unsafe { ::core::mem::transmute(RESRDY) };
            RESRDY as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let OVERRUN: u8 = unsafe { ::core::mem::transmute(OVERRUN) };
            OVERRUN as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let WINMON: u8 = unsafe { ::core::mem::transmute(WINMON) };
            WINMON as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let SYNCRDY: u8 = unsafe { ::core::mem::transmute(SYNCRDY) };
            SYNCRDY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_INTFLAG_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_INTFLAG_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_INTFLAG_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_INTFLAG_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_INTFLAG_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_INTFLAG_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INTFLAG_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_INTFLAG_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_INTFLAG_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_STATUS_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_STATUS_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_STATUS_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_STATUS_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_STATUS_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_STATUS_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_STATUS_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_STATUS_Type__bindgen_ty_1))
    );
}
impl ADC_STATUS_Type__bindgen_ty_1 {
    #[inline]
    pub fn SYNCBUSY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SYNCBUSY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(SYNCBUSY: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let SYNCBUSY: u8 = unsafe { ::core::mem::transmute(SYNCBUSY) };
            SYNCBUSY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_STATUS_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_STATUS_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_STATUS_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_STATUS_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_STATUS_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_STATUS_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_STATUS_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_STATUS_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_STATUS_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_RESULT_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_RESULT_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_RESULT_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
}
#[test]
fn bindgen_test_layout_ADC_RESULT_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_RESULT_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_RESULT_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_RESULT_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_RESULT_Type__bindgen_ty_1))
    );
}
impl ADC_RESULT_Type__bindgen_ty_1 {
    #[inline]
    pub fn RESULT(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u16) }
    }
    #[inline]
    pub fn set_RESULT(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(RESULT: u16) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let RESULT: u16 = unsafe { ::core::mem::transmute(RESULT) };
            RESULT as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_RESULT_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_RESULT_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_RESULT_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_RESULT_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_RESULT_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_RESULT_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_RESULT_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_RESULT_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_RESULT_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_WINLT_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_WINLT_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_WINLT_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
}
#[test]
fn bindgen_test_layout_ADC_WINLT_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_WINLT_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_WINLT_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_WINLT_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_WINLT_Type__bindgen_ty_1))
    );
}
impl ADC_WINLT_Type__bindgen_ty_1 {
    #[inline]
    pub fn WINLT(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u16) }
    }
    #[inline]
    pub fn set_WINLT(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(WINLT: u16) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let WINLT: u16 = unsafe { ::core::mem::transmute(WINLT) };
            WINLT as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_WINLT_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_WINLT_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_WINLT_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_WINLT_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_WINLT_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_WINLT_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_WINLT_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_WINLT_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_WINLT_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_WINUT_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_WINUT_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_WINUT_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
}
#[test]
fn bindgen_test_layout_ADC_WINUT_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_WINUT_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_WINUT_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_WINUT_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_WINUT_Type__bindgen_ty_1))
    );
}
impl ADC_WINUT_Type__bindgen_ty_1 {
    #[inline]
    pub fn WINUT(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u16) }
    }
    #[inline]
    pub fn set_WINUT(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(WINUT: u16) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let WINUT: u16 = unsafe { ::core::mem::transmute(WINUT) };
            WINUT as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_WINUT_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_WINUT_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_WINUT_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_WINUT_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_WINUT_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_WINUT_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_WINUT_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_WINUT_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_WINUT_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_GAINCORR_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_GAINCORR_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_GAINCORR_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
}
#[test]
fn bindgen_test_layout_ADC_GAINCORR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_GAINCORR_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_GAINCORR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_GAINCORR_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_GAINCORR_Type__bindgen_ty_1))
    );
}
impl ADC_GAINCORR_Type__bindgen_ty_1 {
    #[inline]
    pub fn GAINCORR(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 12u8) as u16) }
    }
    #[inline]
    pub fn set_GAINCORR(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(GAINCORR: u16) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 12u8, {
            let GAINCORR: u16 = unsafe { ::core::mem::transmute(GAINCORR) };
            GAINCORR as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_GAINCORR_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_GAINCORR_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_GAINCORR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_GAINCORR_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_GAINCORR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_GAINCORR_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_GAINCORR_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_GAINCORR_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_GAINCORR_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_OFFSETCORR_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_OFFSETCORR_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_OFFSETCORR_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
}
#[test]
fn bindgen_test_layout_ADC_OFFSETCORR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_OFFSETCORR_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_OFFSETCORR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_OFFSETCORR_Type__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(ADC_OFFSETCORR_Type__bindgen_ty_1)
        )
    );
}
impl ADC_OFFSETCORR_Type__bindgen_ty_1 {
    #[inline]
    pub fn OFFSETCORR(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 12u8) as u16) }
    }
    #[inline]
    pub fn set_OFFSETCORR(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(OFFSETCORR: u16) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 12u8, {
            let OFFSETCORR: u16 = unsafe { ::core::mem::transmute(OFFSETCORR) };
            OFFSETCORR as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_OFFSETCORR_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_OFFSETCORR_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_OFFSETCORR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_OFFSETCORR_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_OFFSETCORR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_OFFSETCORR_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_OFFSETCORR_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_OFFSETCORR_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_OFFSETCORR_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_CALIB_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_CALIB_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ADC_CALIB_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_CALIB_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_CALIB_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_CALIB_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CALIB_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_CALIB_Type__bindgen_ty_1))
    );
}
impl ADC_CALIB_Type__bindgen_ty_1 {
    #[inline]
    pub fn LINEARITY_CAL(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u16) }
    }
    #[inline]
    pub fn set_LINEARITY_CAL(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn BIAS_CAL(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_BIAS_CAL(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        LINEARITY_CAL: u16,
        BIAS_CAL: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let LINEARITY_CAL: u16 = unsafe { ::core::mem::transmute(LINEARITY_CAL) };
            LINEARITY_CAL as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let BIAS_CAL: u16 = unsafe { ::core::mem::transmute(BIAS_CAL) };
            BIAS_CAL as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_CALIB_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_CALIB_Type>(),
        2usize,
        concat!("Size of: ", stringify!(ADC_CALIB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_CALIB_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(ADC_CALIB_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_CALIB_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CALIB_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_CALIB_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_CALIB_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ADC_DBGCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: ADC_DBGCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_DBGCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ADC_DBGCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ADC_DBGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_DBGCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_DBGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_DBGCTRL_Type__bindgen_ty_1))
    );
}
impl ADC_DBGCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn DBGRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_DBGRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(DBGRUN: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let DBGRUN: u8 = unsafe { ::core::mem::transmute(DBGRUN) };
            DBGRUN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ADC_DBGCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<ADC_DBGCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(ADC_DBGCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_DBGCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(ADC_DBGCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_DBGCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_DBGCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_DBGCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_DBGCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Adc {
    #[doc = "< \\brief Offset: 0x00 (R/W  8) Control A"]
    pub CTRLA: ADC_CTRLA_Type,
    #[doc = "< \\brief Offset: 0x01 (R/W  8) Reference Control"]
    pub REFCTRL: ADC_REFCTRL_Type,
    #[doc = "< \\brief Offset: 0x02 (R/W  8) Average Control"]
    pub AVGCTRL: ADC_AVGCTRL_Type,
    #[doc = "< \\brief Offset: 0x03 (R/W  8) Sampling Time Control"]
    pub SAMPCTRL: ADC_SAMPCTRL_Type,
    #[doc = "< \\brief Offset: 0x04 (R/W 16) Control B"]
    pub CTRLB: ADC_CTRLB_Type,
    pub Reserved1: [RoReg8; 2usize],
    #[doc = "< \\brief Offset: 0x08 (R/W  8) Window Monitor Control"]
    pub WINCTRL: ADC_WINCTRL_Type,
    pub Reserved2: [RoReg8; 3usize],
    #[doc = "< \\brief Offset: 0x0C (R/W  8) Software Trigger"]
    pub SWTRIG: ADC_SWTRIG_Type,
    pub Reserved3: [RoReg8; 3usize],
    #[doc = "< \\brief Offset: 0x10 (R/W 32) Input Control"]
    pub INPUTCTRL: ADC_INPUTCTRL_Type,
    #[doc = "< \\brief Offset: 0x14 (R/W  8) Event Control"]
    pub EVCTRL: ADC_EVCTRL_Type,
    pub Reserved4: [RoReg8; 1usize],
    #[doc = "< \\brief Offset: 0x16 (R/W  8) Interrupt Enable Clear"]
    pub INTENCLR: ADC_INTENCLR_Type,
    #[doc = "< \\brief Offset: 0x17 (R/W  8) Interrupt Enable Set"]
    pub INTENSET: ADC_INTENSET_Type,
    #[doc = "< \\brief Offset: 0x18 (R/W  8) Interrupt Flag Status and Clear"]
    pub INTFLAG: ADC_INTFLAG_Type,
    #[doc = "< \\brief Offset: 0x19 (R/   8) Status"]
    pub STATUS: ADC_STATUS_Type,
    #[doc = "< \\brief Offset: 0x1A (R/  16) Result"]
    pub RESULT: ADC_RESULT_Type,
    #[doc = "< \\brief Offset: 0x1C (R/W 16) Window Monitor Lower Threshold"]
    pub WINLT: ADC_WINLT_Type,
    pub Reserved5: [RoReg8; 2usize],
    #[doc = "< \\brief Offset: 0x20 (R/W 16) Window Monitor Upper Threshold"]
    pub WINUT: ADC_WINUT_Type,
    pub Reserved6: [RoReg8; 2usize],
    #[doc = "< \\brief Offset: 0x24 (R/W 16) Gain Correction"]
    pub GAINCORR: ADC_GAINCORR_Type,
    #[doc = "< \\brief Offset: 0x26 (R/W 16) Offset Correction"]
    pub OFFSETCORR: ADC_OFFSETCORR_Type,
    #[doc = "< \\brief Offset: 0x28 (R/W 16) Calibration"]
    pub CALIB: ADC_CALIB_Type,
    #[doc = "< \\brief Offset: 0x2A (R/W  8) Debug Control"]
    pub DBGCTRL: ADC_DBGCTRL_Type,
}
#[test]
fn bindgen_test_layout_Adc() {
    assert_eq!(
        ::core::mem::size_of::<Adc>(),
        44usize,
        concat!("Size of: ", stringify!(Adc))
    );
    assert_eq!(
        ::core::mem::align_of::<Adc>(),
        4usize,
        concat!("Alignment of ", stringify!(Adc))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).CTRLA as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(CTRLA)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).REFCTRL as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(REFCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).AVGCTRL as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(AVGCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).SAMPCTRL as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(SAMPCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).CTRLB as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(CTRLB)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).Reserved1 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(Reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).WINCTRL as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(WINCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).Reserved2 as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(Reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).SWTRIG as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(SWTRIG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).Reserved3 as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(Reserved3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).INPUTCTRL as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(INPUTCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).EVCTRL as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(EVCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).Reserved4 as *const _ as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(Reserved4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).INTENCLR as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(INTENCLR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).INTENSET as *const _ as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(INTENSET)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).INTFLAG as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(INTFLAG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).STATUS as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(STATUS)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).RESULT as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(RESULT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).WINLT as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(WINLT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).Reserved5 as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(Reserved5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).WINUT as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(WINUT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).Reserved6 as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(Reserved6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).GAINCORR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(GAINCORR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).OFFSETCORR as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(OFFSETCORR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).CALIB as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(CALIB)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Adc>())).DBGCTRL as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(Adc),
            "::",
            stringify!(DBGCTRL)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DAC_CTRLA_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DAC_CTRLA_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DAC_CTRLA_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_DAC_CTRLA_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DAC_CTRLA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_CTRLA_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_CTRLA_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_CTRLA_Type__bindgen_ty_1))
    );
}
impl DAC_CTRLA_Type__bindgen_ty_1 {
    #[inline]
    pub fn SWRST(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SWRST(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ENABLE(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ENABLE(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn RUNSTDBY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_RUNSTDBY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SWRST: u8,
        ENABLE: u8,
        RUNSTDBY: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let SWRST: u8 = unsafe { ::core::mem::transmute(SWRST) };
            SWRST as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ENABLE: u8 = unsafe { ::core::mem::transmute(ENABLE) };
            ENABLE as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let RUNSTDBY: u8 = unsafe { ::core::mem::transmute(RUNSTDBY) };
            RUNSTDBY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DAC_CTRLA_Type() {
    assert_eq!(
        ::core::mem::size_of::<DAC_CTRLA_Type>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_CTRLA_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_CTRLA_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_CTRLA_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_CTRLA_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_CTRLA_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_CTRLA_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_CTRLA_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DAC_CTRLB_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DAC_CTRLB_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DAC_CTRLB_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_DAC_CTRLB_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DAC_CTRLB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_CTRLB_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_CTRLB_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_CTRLB_Type__bindgen_ty_1))
    );
}
impl DAC_CTRLB_Type__bindgen_ty_1 {
    #[inline]
    pub fn EOEN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_EOEN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn IOEN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_IOEN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LEFTADJ(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_LEFTADJ(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn VPD(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_VPD(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BDWP(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_BDWP(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn REFSEL(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_REFSEL(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        EOEN: u8,
        IOEN: u8,
        LEFTADJ: u8,
        VPD: u8,
        BDWP: u8,
        REFSEL: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let EOEN: u8 = unsafe { ::core::mem::transmute(EOEN) };
            EOEN as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let IOEN: u8 = unsafe { ::core::mem::transmute(IOEN) };
            IOEN as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let LEFTADJ: u8 = unsafe { ::core::mem::transmute(LEFTADJ) };
            LEFTADJ as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let VPD: u8 = unsafe { ::core::mem::transmute(VPD) };
            VPD as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let BDWP: u8 = unsafe { ::core::mem::transmute(BDWP) };
            BDWP as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let REFSEL: u8 = unsafe { ::core::mem::transmute(REFSEL) };
            REFSEL as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DAC_CTRLB_Type() {
    assert_eq!(
        ::core::mem::size_of::<DAC_CTRLB_Type>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_CTRLB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_CTRLB_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_CTRLB_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_CTRLB_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_CTRLB_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_CTRLB_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_CTRLB_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DAC_EVCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DAC_EVCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DAC_EVCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_DAC_EVCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DAC_EVCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_EVCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_EVCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_EVCTRL_Type__bindgen_ty_1))
    );
}
impl DAC_EVCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn STARTEI(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_STARTEI(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn EMPTYEO(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_EMPTYEO(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(STARTEI: u8, EMPTYEO: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let STARTEI: u8 = unsafe { ::core::mem::transmute(STARTEI) };
            STARTEI as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let EMPTYEO: u8 = unsafe { ::core::mem::transmute(EMPTYEO) };
            EMPTYEO as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DAC_EVCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<DAC_EVCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_EVCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_EVCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_EVCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_EVCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_EVCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_EVCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_EVCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DAC_INTENCLR_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DAC_INTENCLR_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DAC_INTENCLR_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_DAC_INTENCLR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DAC_INTENCLR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_INTENCLR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_INTENCLR_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_INTENCLR_Type__bindgen_ty_1))
    );
}
impl DAC_INTENCLR_Type__bindgen_ty_1 {
    #[inline]
    pub fn UNDERRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_UNDERRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn EMPTY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_EMPTY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SYNCRDY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SYNCRDY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        UNDERRUN: u8,
        EMPTY: u8,
        SYNCRDY: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let UNDERRUN: u8 = unsafe { ::core::mem::transmute(UNDERRUN) };
            UNDERRUN as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let EMPTY: u8 = unsafe { ::core::mem::transmute(EMPTY) };
            EMPTY as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let SYNCRDY: u8 = unsafe { ::core::mem::transmute(SYNCRDY) };
            SYNCRDY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DAC_INTENCLR_Type() {
    assert_eq!(
        ::core::mem::size_of::<DAC_INTENCLR_Type>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_INTENCLR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_INTENCLR_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_INTENCLR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_INTENCLR_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_INTENCLR_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_INTENCLR_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_INTENCLR_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DAC_INTENSET_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DAC_INTENSET_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DAC_INTENSET_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_DAC_INTENSET_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DAC_INTENSET_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_INTENSET_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_INTENSET_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_INTENSET_Type__bindgen_ty_1))
    );
}
impl DAC_INTENSET_Type__bindgen_ty_1 {
    #[inline]
    pub fn UNDERRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_UNDERRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn EMPTY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_EMPTY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SYNCRDY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SYNCRDY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        UNDERRUN: u8,
        EMPTY: u8,
        SYNCRDY: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let UNDERRUN: u8 = unsafe { ::core::mem::transmute(UNDERRUN) };
            UNDERRUN as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let EMPTY: u8 = unsafe { ::core::mem::transmute(EMPTY) };
            EMPTY as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let SYNCRDY: u8 = unsafe { ::core::mem::transmute(SYNCRDY) };
            SYNCRDY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DAC_INTENSET_Type() {
    assert_eq!(
        ::core::mem::size_of::<DAC_INTENSET_Type>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_INTENSET_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_INTENSET_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_INTENSET_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_INTENSET_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_INTENSET_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_INTENSET_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_INTENSET_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DAC_INTFLAG_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DAC_INTFLAG_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DAC_INTFLAG_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_DAC_INTFLAG_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DAC_INTFLAG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_INTFLAG_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_INTFLAG_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_INTFLAG_Type__bindgen_ty_1))
    );
}
impl DAC_INTFLAG_Type__bindgen_ty_1 {
    #[inline]
    pub fn UNDERRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_UNDERRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn EMPTY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_EMPTY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SYNCRDY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SYNCRDY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        UNDERRUN: u8,
        EMPTY: u8,
        SYNCRDY: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let UNDERRUN: u8 = unsafe { ::core::mem::transmute(UNDERRUN) };
            UNDERRUN as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let EMPTY: u8 = unsafe { ::core::mem::transmute(EMPTY) };
            EMPTY as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let SYNCRDY: u8 = unsafe { ::core::mem::transmute(SYNCRDY) };
            SYNCRDY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DAC_INTFLAG_Type() {
    assert_eq!(
        ::core::mem::size_of::<DAC_INTFLAG_Type>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_INTFLAG_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_INTFLAG_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_INTFLAG_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_INTFLAG_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_INTFLAG_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_INTFLAG_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_INTFLAG_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DAC_STATUS_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DAC_STATUS_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DAC_STATUS_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_DAC_STATUS_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DAC_STATUS_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_STATUS_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_STATUS_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_STATUS_Type__bindgen_ty_1))
    );
}
impl DAC_STATUS_Type__bindgen_ty_1 {
    #[inline]
    pub fn SYNCBUSY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SYNCBUSY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(SYNCBUSY: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let SYNCBUSY: u8 = unsafe { ::core::mem::transmute(SYNCBUSY) };
            SYNCBUSY as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DAC_STATUS_Type() {
    assert_eq!(
        ::core::mem::size_of::<DAC_STATUS_Type>(),
        1usize,
        concat!("Size of: ", stringify!(DAC_STATUS_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_STATUS_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_STATUS_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_STATUS_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_STATUS_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_STATUS_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_STATUS_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DAC_DATA_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DAC_DATA_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct DAC_DATA_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
}
#[test]
fn bindgen_test_layout_DAC_DATA_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DAC_DATA_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(DAC_DATA_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_DATA_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(DAC_DATA_Type__bindgen_ty_1))
    );
}
impl DAC_DATA_Type__bindgen_ty_1 {
    #[inline]
    pub fn DATA(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u16) }
    }
    #[inline]
    pub fn set_DATA(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(DATA: u16) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let DATA: u16 = unsafe { ::core::mem::transmute(DATA) };
            DATA as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DAC_DATA_Type() {
    assert_eq!(
        ::core::mem::size_of::<DAC_DATA_Type>(),
        2usize,
        concat!("Size of: ", stringify!(DAC_DATA_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_DATA_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(DAC_DATA_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_DATA_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_DATA_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_DATA_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_DATA_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DAC_DATABUF_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DAC_DATABUF_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct DAC_DATABUF_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
}
#[test]
fn bindgen_test_layout_DAC_DATABUF_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DAC_DATABUF_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(DAC_DATABUF_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_DATABUF_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(DAC_DATABUF_Type__bindgen_ty_1))
    );
}
impl DAC_DATABUF_Type__bindgen_ty_1 {
    #[inline]
    pub fn DATABUF(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u16) }
    }
    #[inline]
    pub fn set_DATABUF(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(DATABUF: u16) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let DATABUF: u16 = unsafe { ::core::mem::transmute(DATABUF) };
            DATABUF as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DAC_DATABUF_Type() {
    assert_eq!(
        ::core::mem::size_of::<DAC_DATABUF_Type>(),
        2usize,
        concat!("Size of: ", stringify!(DAC_DATABUF_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DAC_DATABUF_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(DAC_DATABUF_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_DATABUF_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_DATABUF_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DAC_DATABUF_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_DATABUF_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Dac {
    #[doc = "< \\brief Offset: 0x0 (R/W  8) Control A"]
    pub CTRLA: DAC_CTRLA_Type,
    #[doc = "< \\brief Offset: 0x1 (R/W  8) Control B"]
    pub CTRLB: DAC_CTRLB_Type,
    #[doc = "< \\brief Offset: 0x2 (R/W  8) Event Control"]
    pub EVCTRL: DAC_EVCTRL_Type,
    pub Reserved1: [RoReg8; 1usize],
    #[doc = "< \\brief Offset: 0x4 (R/W  8) Interrupt Enable Clear"]
    pub INTENCLR: DAC_INTENCLR_Type,
    #[doc = "< \\brief Offset: 0x5 (R/W  8) Interrupt Enable Set"]
    pub INTENSET: DAC_INTENSET_Type,
    #[doc = "< \\brief Offset: 0x6 (R/W  8) Interrupt Flag Status and Clear"]
    pub INTFLAG: DAC_INTFLAG_Type,
    #[doc = "< \\brief Offset: 0x7 (R/   8) Status"]
    pub STATUS: DAC_STATUS_Type,
    #[doc = "< \\brief Offset: 0x8 (R/W 16) Data"]
    pub DATA: DAC_DATA_Type,
    pub Reserved2: [RoReg8; 2usize],
    #[doc = "< \\brief Offset: 0xC (R/W 16) Data Buffer"]
    pub DATABUF: DAC_DATABUF_Type,
}
#[test]
fn bindgen_test_layout_Dac() {
    assert_eq!(
        ::core::mem::size_of::<Dac>(),
        14usize,
        concat!("Size of: ", stringify!(Dac))
    );
    assert_eq!(
        ::core::mem::align_of::<Dac>(),
        2usize,
        concat!("Alignment of ", stringify!(Dac))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Dac>())).CTRLA as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Dac),
            "::",
            stringify!(CTRLA)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Dac>())).CTRLB as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Dac),
            "::",
            stringify!(CTRLB)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Dac>())).EVCTRL as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Dac),
            "::",
            stringify!(EVCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Dac>())).Reserved1 as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(Dac),
            "::",
            stringify!(Reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Dac>())).INTENCLR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Dac),
            "::",
            stringify!(INTENCLR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Dac>())).INTENSET as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(Dac),
            "::",
            stringify!(INTENSET)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Dac>())).INTFLAG as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Dac),
            "::",
            stringify!(INTFLAG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Dac>())).STATUS as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(Dac),
            "::",
            stringify!(STATUS)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Dac>())).DATA as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(Dac), "::", stringify!(DATA))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Dac>())).Reserved2 as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(Dac),
            "::",
            stringify!(Reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Dac>())).DATABUF as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Dac),
            "::",
            stringify!(DATABUF)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMAC_CTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DMAC_CTRL_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: DMAC_CTRL_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_CTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
}
#[test]
fn bindgen_test_layout_DMAC_CTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_CTRL_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(DMAC_CTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_CTRL_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(DMAC_CTRL_Type__bindgen_ty_1))
    );
}
impl DMAC_CTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn SWRST(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_SWRST(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn DMAENABLE(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_DMAENABLE(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CRCENABLE(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_CRCENABLE(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LVLEN0(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_LVLEN0(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LVLEN1(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_LVLEN1(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LVLEN2(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_LVLEN2(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LVLEN3(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_LVLEN3(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SWRST: u16,
        DMAENABLE: u16,
        CRCENABLE: u16,
        LVLEN0: u16,
        LVLEN1: u16,
        LVLEN2: u16,
        LVLEN3: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let SWRST: u16 = unsafe { ::core::mem::transmute(SWRST) };
            SWRST as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let DMAENABLE: u16 = unsafe { ::core::mem::transmute(DMAENABLE) };
            DMAENABLE as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let CRCENABLE: u16 = unsafe { ::core::mem::transmute(CRCENABLE) };
            CRCENABLE as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let LVLEN0: u16 = unsafe { ::core::mem::transmute(LVLEN0) };
            LVLEN0 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let LVLEN1: u16 = unsafe { ::core::mem::transmute(LVLEN1) };
            LVLEN1 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let LVLEN2: u16 = unsafe { ::core::mem::transmute(LVLEN2) };
            LVLEN2 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let LVLEN3: u16 = unsafe { ::core::mem::transmute(LVLEN3) };
            LVLEN3 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_CTRL_Type__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
}
#[test]
fn bindgen_test_layout_DMAC_CTRL_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_CTRL_Type__bindgen_ty_2>(),
        2usize,
        concat!("Size of: ", stringify!(DMAC_CTRL_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_CTRL_Type__bindgen_ty_2>(),
        2usize,
        concat!("Alignment of ", stringify!(DMAC_CTRL_Type__bindgen_ty_2))
    );
}
impl DMAC_CTRL_Type__bindgen_ty_2 {
    #[inline]
    pub fn LVLEN(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_LVLEN(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(LVLEN: u16) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let LVLEN: u16 = unsafe { ::core::mem::transmute(LVLEN) };
            LVLEN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DMAC_CTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_CTRL_Type>(),
        2usize,
        concat!("Size of: ", stringify!(DMAC_CTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_CTRL_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(DMAC_CTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_CTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_CTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_CTRL_Type>())).vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_CTRL_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_CTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_CTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMAC_CRCCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DMAC_CRCCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_CRCCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
}
#[test]
fn bindgen_test_layout_DMAC_CRCCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_CRCCTRL_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(DMAC_CRCCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_CRCCTRL_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(DMAC_CRCCTRL_Type__bindgen_ty_1))
    );
}
impl DMAC_CRCCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn CRCBEATSIZE(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_CRCBEATSIZE(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn CRCPOLY(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_CRCPOLY(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn CRCSRC(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 6u8) as u16) }
    }
    #[inline]
    pub fn set_CRCSRC(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        CRCBEATSIZE: u16,
        CRCPOLY: u16,
        CRCSRC: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let CRCBEATSIZE: u16 = unsafe { ::core::mem::transmute(CRCBEATSIZE) };
            CRCBEATSIZE as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let CRCPOLY: u16 = unsafe { ::core::mem::transmute(CRCPOLY) };
            CRCPOLY as u64
        });
        __bindgen_bitfield_unit.set(8usize, 6u8, {
            let CRCSRC: u16 = unsafe { ::core::mem::transmute(CRCSRC) };
            CRCSRC as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DMAC_CRCCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_CRCCTRL_Type>(),
        2usize,
        concat!("Size of: ", stringify!(DMAC_CRCCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_CRCCTRL_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(DMAC_CRCCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_CRCCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_CRCCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_CRCCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_CRCCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMAC_CRCDATAIN_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DMAC_CRCDATAIN_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_CRCDATAIN_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
}
#[test]
fn bindgen_test_layout_DMAC_CRCDATAIN_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_CRCDATAIN_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_CRCDATAIN_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_CRCDATAIN_Type__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(DMAC_CRCDATAIN_Type__bindgen_ty_1)
        )
    );
}
impl DMAC_CRCDATAIN_Type__bindgen_ty_1 {
    #[inline]
    pub fn CRCDATAIN(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_CRCDATAIN(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(CRCDATAIN: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 32u8, {
            let CRCDATAIN: u32 = unsafe { ::core::mem::transmute(CRCDATAIN) };
            CRCDATAIN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DMAC_CRCDATAIN_Type() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_CRCDATAIN_Type>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_CRCDATAIN_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_CRCDATAIN_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(DMAC_CRCDATAIN_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_CRCDATAIN_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_CRCDATAIN_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_CRCDATAIN_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_CRCDATAIN_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMAC_CRCCHKSUM_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DMAC_CRCCHKSUM_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_CRCCHKSUM_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
}
#[test]
fn bindgen_test_layout_DMAC_CRCCHKSUM_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_CRCCHKSUM_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_CRCCHKSUM_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_CRCCHKSUM_Type__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(DMAC_CRCCHKSUM_Type__bindgen_ty_1)
        )
    );
}
impl DMAC_CRCCHKSUM_Type__bindgen_ty_1 {
    #[inline]
    pub fn CRCCHKSUM(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_CRCCHKSUM(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(CRCCHKSUM: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 32u8, {
            let CRCCHKSUM: u32 = unsafe { ::core::mem::transmute(CRCCHKSUM) };
            CRCCHKSUM as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DMAC_CRCCHKSUM_Type() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_CRCCHKSUM_Type>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_CRCCHKSUM_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_CRCCHKSUM_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(DMAC_CRCCHKSUM_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_CRCCHKSUM_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_CRCCHKSUM_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_CRCCHKSUM_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_CRCCHKSUM_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMAC_CRCSTATUS_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DMAC_CRCSTATUS_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_CRCSTATUS_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_DMAC_CRCSTATUS_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_CRCSTATUS_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(DMAC_CRCSTATUS_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_CRCSTATUS_Type__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(DMAC_CRCSTATUS_Type__bindgen_ty_1)
        )
    );
}
impl DMAC_CRCSTATUS_Type__bindgen_ty_1 {
    #[inline]
    pub fn CRCBUSY(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_CRCBUSY(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CRCZERO(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_CRCZERO(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(CRCBUSY: u8, CRCZERO: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let CRCBUSY: u8 = unsafe { ::core::mem::transmute(CRCBUSY) };
            CRCBUSY as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let CRCZERO: u8 = unsafe { ::core::mem::transmute(CRCZERO) };
            CRCZERO as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DMAC_CRCSTATUS_Type() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_CRCSTATUS_Type>(),
        1usize,
        concat!("Size of: ", stringify!(DMAC_CRCSTATUS_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_CRCSTATUS_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(DMAC_CRCSTATUS_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_CRCSTATUS_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_CRCSTATUS_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_CRCSTATUS_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_CRCSTATUS_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMAC_DBGCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DMAC_DBGCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_DBGCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_DMAC_DBGCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_DBGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(DMAC_DBGCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_DBGCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(DMAC_DBGCTRL_Type__bindgen_ty_1))
    );
}
impl DMAC_DBGCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn DBGRUN(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_DBGRUN(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(DBGRUN: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let DBGRUN: u8 = unsafe { ::core::mem::transmute(DBGRUN) };
            DBGRUN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DMAC_DBGCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_DBGCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(DMAC_DBGCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_DBGCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(DMAC_DBGCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_DBGCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_DBGCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_DBGCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_DBGCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMAC_QOSCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DMAC_QOSCTRL_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_QOSCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_DMAC_QOSCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_QOSCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(DMAC_QOSCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_QOSCTRL_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(DMAC_QOSCTRL_Type__bindgen_ty_1))
    );
}
impl DMAC_QOSCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn WRBQOS(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_WRBQOS(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn FQOS(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_FQOS(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn DQOS(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_DQOS(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        WRBQOS: u8,
        FQOS: u8,
        DQOS: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let WRBQOS: u8 = unsafe { ::core::mem::transmute(WRBQOS) };
            WRBQOS as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let FQOS: u8 = unsafe { ::core::mem::transmute(FQOS) };
            FQOS as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let DQOS: u8 = unsafe { ::core::mem::transmute(DQOS) };
            DQOS as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DMAC_QOSCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_QOSCTRL_Type>(),
        1usize,
        concat!("Size of: ", stringify!(DMAC_QOSCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_QOSCTRL_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(DMAC_QOSCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_QOSCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_QOSCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_QOSCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_QOSCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMAC_SWTRIGCTRL_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DMAC_SWTRIGCTRL_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: DMAC_SWTRIGCTRL_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_SWTRIGCTRL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u8>,
}
#[test]
fn bindgen_test_layout_DMAC_SWTRIGCTRL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_SWTRIGCTRL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_SWTRIGCTRL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_SWTRIGCTRL_Type__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(DMAC_SWTRIGCTRL_Type__bindgen_ty_1)
        )
    );
}
impl DMAC_SWTRIGCTRL_Type__bindgen_ty_1 {
    #[inline]
    pub fn SWTRIG0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SWTRIG1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SWTRIG2(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SWTRIG3(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG3(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SWTRIG4(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG4(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SWTRIG5(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG5(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SWTRIG6(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG6(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SWTRIG7(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG7(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SWTRIG8(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG8(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SWTRIG9(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG9(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SWTRIG10(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG10(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SWTRIG11(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG11(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SWTRIG0: u32,
        SWTRIG1: u32,
        SWTRIG2: u32,
        SWTRIG3: u32,
        SWTRIG4: u32,
        SWTRIG5: u32,
        SWTRIG6: u32,
        SWTRIG7: u32,
        SWTRIG8: u32,
        SWTRIG9: u32,
        SWTRIG10: u32,
        SWTRIG11: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let SWTRIG0: u32 = unsafe { ::core::mem::transmute(SWTRIG0) };
            SWTRIG0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let SWTRIG1: u32 = unsafe { ::core::mem::transmute(SWTRIG1) };
            SWTRIG1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let SWTRIG2: u32 = unsafe { ::core::mem::transmute(SWTRIG2) };
            SWTRIG2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let SWTRIG3: u32 = unsafe { ::core::mem::transmute(SWTRIG3) };
            SWTRIG3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let SWTRIG4: u32 = unsafe { ::core::mem::transmute(SWTRIG4) };
            SWTRIG4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let SWTRIG5: u32 = unsafe { ::core::mem::transmute(SWTRIG5) };
            SWTRIG5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let SWTRIG6: u32 = unsafe { ::core::mem::transmute(SWTRIG6) };
            SWTRIG6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let SWTRIG7: u32 = unsafe { ::core::mem::transmute(SWTRIG7) };
            SWTRIG7 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let SWTRIG8: u32 = unsafe { ::core::mem::transmute(SWTRIG8) };
            SWTRIG8 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let SWTRIG9: u32 = unsafe { ::core::mem::transmute(SWTRIG9) };
            SWTRIG9 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let SWTRIG10: u32 = unsafe { ::core::mem::transmute(SWTRIG10) };
            SWTRIG10 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let SWTRIG11: u32 = unsafe { ::core::mem::transmute(SWTRIG11) };
            SWTRIG11 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_SWTRIGCTRL_Type__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
}
#[test]
fn bindgen_test_layout_DMAC_SWTRIGCTRL_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_SWTRIGCTRL_Type__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_SWTRIGCTRL_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_SWTRIGCTRL_Type__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(DMAC_SWTRIGCTRL_Type__bindgen_ty_2)
        )
    );
}
impl DMAC_SWTRIGCTRL_Type__bindgen_ty_2 {
    #[inline]
    pub fn SWTRIG(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 12u8) as u32) }
    }
    #[inline]
    pub fn set_SWTRIG(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(SWTRIG: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 12u8, {
            let SWTRIG: u32 = unsafe { ::core::mem::transmute(SWTRIG) };
            SWTRIG as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DMAC_SWTRIGCTRL_Type() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_SWTRIGCTRL_Type>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_SWTRIGCTRL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_SWTRIGCTRL_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(DMAC_SWTRIGCTRL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_SWTRIGCTRL_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_SWTRIGCTRL_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_SWTRIGCTRL_Type>())).vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_SWTRIGCTRL_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_SWTRIGCTRL_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_SWTRIGCTRL_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMAC_PRICTRL0_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DMAC_PRICTRL0_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_PRICTRL0_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u8>,
}
#[test]
fn bindgen_test_layout_DMAC_PRICTRL0_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_PRICTRL0_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_PRICTRL0_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_PRICTRL0_Type__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(DMAC_PRICTRL0_Type__bindgen_ty_1)
        )
    );
}
impl DMAC_PRICTRL0_Type__bindgen_ty_1 {
    #[inline]
    pub fn LVLPRI0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_LVLPRI0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn RRLVLEN0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_RRLVLEN0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LVLPRI1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_LVLPRI1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn RRLVLEN1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_RRLVLEN1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LVLPRI2(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_LVLPRI2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn RRLVLEN2(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_RRLVLEN2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn LVLPRI3(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_LVLPRI3(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn RRLVLEN3(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_RRLVLEN3(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        LVLPRI0: u32,
        RRLVLEN0: u32,
        LVLPRI1: u32,
        RRLVLEN1: u32,
        LVLPRI2: u32,
        RRLVLEN2: u32,
        LVLPRI3: u32,
        RRLVLEN3: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let LVLPRI0: u32 = unsafe { ::core::mem::transmute(LVLPRI0) };
            LVLPRI0 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let RRLVLEN0: u32 = unsafe { ::core::mem::transmute(RRLVLEN0) };
            RRLVLEN0 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let LVLPRI1: u32 = unsafe { ::core::mem::transmute(LVLPRI1) };
            LVLPRI1 as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let RRLVLEN1: u32 = unsafe { ::core::mem::transmute(RRLVLEN1) };
            RRLVLEN1 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let LVLPRI2: u32 = unsafe { ::core::mem::transmute(LVLPRI2) };
            LVLPRI2 as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let RRLVLEN2: u32 = unsafe { ::core::mem::transmute(RRLVLEN2) };
            RRLVLEN2 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 4u8, {
            let LVLPRI3: u32 = unsafe { ::core::mem::transmute(LVLPRI3) };
            LVLPRI3 as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let RRLVLEN3: u32 = unsafe { ::core::mem::transmute(RRLVLEN3) };
            RRLVLEN3 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DMAC_PRICTRL0_Type() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_PRICTRL0_Type>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_PRICTRL0_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_PRICTRL0_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(DMAC_PRICTRL0_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_PRICTRL0_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_PRICTRL0_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_PRICTRL0_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_PRICTRL0_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMAC_INTPEND_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DMAC_INTPEND_Type__bindgen_ty_1,
    #[doc = "< Type      used for register access"]
    pub reg: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_INTPEND_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
}
#[test]
fn bindgen_test_layout_DMAC_INTPEND_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_INTPEND_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(DMAC_INTPEND_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_INTPEND_Type__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(DMAC_INTPEND_Type__bindgen_ty_1))
    );
}
impl DMAC_INTPEND_Type__bindgen_ty_1 {
    #[inline]
    pub fn ID(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_ID(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn TERR(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_TERR(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn TCMPL(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_TCMPL(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SUSP(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_SUSP(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FERR(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_FERR(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BUSY(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_BUSY(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn PEND(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_PEND(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ID: u16,
        TERR: u16,
        TCMPL: u16,
        SUSP: u16,
        FERR: u16,
        BUSY: u16,
        PEND: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let ID: u16 = unsafe { ::core::mem::transmute(ID) };
            ID as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let TERR: u16 = unsafe { ::core::mem::transmute(TERR) };
            TERR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let TCMPL: u16 = unsafe { ::core::mem::transmute(TCMPL) };
            TCMPL as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let SUSP: u16 = unsafe { ::core::mem::transmute(SUSP) };
            SUSP as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let FERR: u16 = unsafe { ::core::mem::transmute(FERR) };
            FERR as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let BUSY: u16 = unsafe { ::core::mem::transmute(BUSY) };
            BUSY as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let PEND: u16 = unsafe { ::core::mem::transmute(PEND) };
            PEND as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DMAC_INTPEND_Type() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_INTPEND_Type>(),
        2usize,
        concat!("Size of: ", stringify!(DMAC_INTPEND_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_INTPEND_Type>(),
        2usize,
        concat!("Alignment of ", stringify!(DMAC_INTPEND_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_INTPEND_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_INTPEND_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_INTPEND_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_INTPEND_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMAC_INTSTATUS_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DMAC_INTSTATUS_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: DMAC_INTSTATUS_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_INTSTATUS_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u8>,
}
#[test]
fn bindgen_test_layout_DMAC_INTSTATUS_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_INTSTATUS_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_INTSTATUS_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_INTSTATUS_Type__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(DMAC_INTSTATUS_Type__bindgen_ty_1)
        )
    );
}
impl DMAC_INTSTATUS_Type__bindgen_ty_1 {
    #[inline]
    pub fn CHINT0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CHINT1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CHINT2(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CHINT3(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT3(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CHINT4(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT4(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CHINT5(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT5(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CHINT6(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT6(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CHINT7(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT7(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CHINT8(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT8(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CHINT9(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT9(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CHINT10(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT10(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CHINT11(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT11(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        CHINT0: u32,
        CHINT1: u32,
        CHINT2: u32,
        CHINT3: u32,
        CHINT4: u32,
        CHINT5: u32,
        CHINT6: u32,
        CHINT7: u32,
        CHINT8: u32,
        CHINT9: u32,
        CHINT10: u32,
        CHINT11: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let CHINT0: u32 = unsafe { ::core::mem::transmute(CHINT0) };
            CHINT0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let CHINT1: u32 = unsafe { ::core::mem::transmute(CHINT1) };
            CHINT1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let CHINT2: u32 = unsafe { ::core::mem::transmute(CHINT2) };
            CHINT2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let CHINT3: u32 = unsafe { ::core::mem::transmute(CHINT3) };
            CHINT3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let CHINT4: u32 = unsafe { ::core::mem::transmute(CHINT4) };
            CHINT4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let CHINT5: u32 = unsafe { ::core::mem::transmute(CHINT5) };
            CHINT5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let CHINT6: u32 = unsafe { ::core::mem::transmute(CHINT6) };
            CHINT6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let CHINT7: u32 = unsafe { ::core::mem::transmute(CHINT7) };
            CHINT7 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let CHINT8: u32 = unsafe { ::core::mem::transmute(CHINT8) };
            CHINT8 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let CHINT9: u32 = unsafe { ::core::mem::transmute(CHINT9) };
            CHINT9 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let CHINT10: u32 = unsafe { ::core::mem::transmute(CHINT10) };
            CHINT10 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let CHINT11: u32 = unsafe { ::core::mem::transmute(CHINT11) };
            CHINT11 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_INTSTATUS_Type__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
}
#[test]
fn bindgen_test_layout_DMAC_INTSTATUS_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_INTSTATUS_Type__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_INTSTATUS_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_INTSTATUS_Type__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(DMAC_INTSTATUS_Type__bindgen_ty_2)
        )
    );
}
impl DMAC_INTSTATUS_Type__bindgen_ty_2 {
    #[inline]
    pub fn CHINT(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 12u8) as u32) }
    }
    #[inline]
    pub fn set_CHINT(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(CHINT: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 12u8, {
            let CHINT: u32 = unsafe { ::core::mem::transmute(CHINT) };
            CHINT as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_DMAC_INTSTATUS_Type() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_INTSTATUS_Type>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_INTSTATUS_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_INTSTATUS_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(DMAC_INTSTATUS_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_INTSTATUS_Type>())).bit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_INTSTATUS_Type),
            "::",
            stringify!(bit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_INTSTATUS_Type>())).vec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_INTSTATUS_Type),
            "::",
            stringify!(vec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMAC_INTSTATUS_Type>())).reg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAC_INTSTATUS_Type),
            "::",
            stringify!(reg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMAC_BUSYCH_Type {
    #[doc = "< Structure used for bit  access"]
    pub bit: DMAC_BUSYCH_Type__bindgen_ty_1,
    #[doc = "< Structure used for vec  access"]
    pub vec: DMAC_BUSYCH_Type__bindgen_ty_2,
    #[doc = "< Type      used for register access"]
    pub reg: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_BUSYCH_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u8>,
}
#[test]
fn bindgen_test_layout_DMAC_BUSYCH_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_BUSYCH_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_BUSYCH_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_BUSYCH_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(DMAC_BUSYCH_Type__bindgen_ty_1))
    );
}
impl DMAC_BUSYCH_Type__bindgen_ty_1 {
    #[inline]
    pub fn BUSYCH0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_BUSYCH0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BUSYCH1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_BUSYCH1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BUSYCH2(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_BUSYCH2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BUSYCH3(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_BUSYCH3(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BUSYCH4(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_BUSYCH4(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BUSYCH5(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_BUSYCH5(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BUSYCH6(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_BUSYCH6(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BUSYCH7(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_BUSYCH7(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BUSYCH8(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_BUSYCH8(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BUSYCH9(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_BUSYCH9(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BUSYCH10(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_BUSYCH10(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BUSYCH11(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_BUSYCH11(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        BUSYCH0: u32,
        BUSYCH1: u32,
        BUSYCH2: u32,
        BUSYCH3: u32,
        BUSYCH4: u32,
        BUSYCH5: u32,
        BUSYCH6: u32,
        BUSYCH7: u32,
        BUSYCH8: u32,
        BUSYCH9: u32,
        BUSYCH10: u32,
        BUSYCH11: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let BUSYCH0: u32 = unsafe { ::core::mem::transmute(BUSYCH0) };
            BUSYCH0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let BUSYCH1: u32 = unsafe { ::core::mem::transmute(BUSYCH1) };
            BUSYCH1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let BUSYCH2: u32 = unsafe { ::core::mem::transmute(BUSYCH2) };
            BUSYCH2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let BUSYCH3: u32 = unsafe { ::core::mem::transmute(BUSYCH3) };
            BUSYCH3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let BUSYCH4: u32 = unsafe { ::core::mem::transmute(BUSYCH4) };
            BUSYCH4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let BUSYCH5: u32 = unsafe { ::core::mem::transmute(BUSYCH5) };
            BUSYCH5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let BUSYCH6: u32 = unsafe { ::core::mem::transmute(BUSYCH6) };
            BUSYCH6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let BUSYCH7: u32 = unsafe { ::core::mem::transmute(BUSYCH7) };
            BUSYCH7 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let BUSYCH8: u32 = unsafe { ::core::mem::transmute(BUSYCH8) };
            BUSYCH8 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let BUSYCH9: u32 = unsafe { ::core::mem::transmute(BUSYCH9) };
            BUSYCH9 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let BUSYCH10: u32 = unsafe { ::core::mem::transmute(BUSYCH10) };
            BUSYCH10 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let BUSYCH11: u32 = unsafe { ::core::mem::transmute(BUSYCH11) };
            BUSYCH11 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct DMAC_BUSYCH_Type__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
}
#[test]
fn bindgen_test_layout_DMAC_BUSYCH_Type__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<DMAC_BUSYCH_Type__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(DMAC_BUSYCH_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<DMAC_BUSYCH_Type__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(DMAC_BUSYCH_Type__bindgen_ty_2))
    );
}
impl DMAC_BUSYCH_Type__bindgen_ty_2 {
    #[inline]
    pub fn BUSYCH(&self) -> u32 {
